<HTML><HEAD><TITLE>Соглашение о предоставлении сервиса игры "Наш Бойцовский Клуб" - www.testcombats.ru</TITLE>
<META content=INDEX,FOLLOW name=robots>
<META http-equiv=Content-Type content="text/html; charset=windows-1251">
<META http-equiv=Pragma content=no-cache>
<META http-equiv=Cache-control content=private>
<META http-equiv=Expires content=0>

<link href="//testcombats.ru/rating_script/images/main1.css" rel="stylesheet" type="text/css">
<style type="text/css">
body {
	width:100%;
	height:100%;
	margin-left: 0px;
	margin-top: 0px;
	margin-right: 0px;
	margin-bottom: 0px;
	background-color: #000;
	font-size: 10pt; font-family: Verdana, Helvetica, Arial, Tahoma, sans-serif;
	//background-image: url(//img.testcombats.ru/admin/bg.jpg);
}
.style6 {	color: #DFD3A3;
	font-size: 9px;
}
A:link {
	FONT-WEIGHT: normal; COLOR: #524936; TEXT-DECORATION: none
}
A:visited {
	FONT-WEIGHT: normal; COLOR: #633525; TEXT-DECORATION: none
}
A:active {
	FONT-WEIGHT: normal; COLOR: #77684d; TEXT-DECORATION: none
}
A:hover {
	COLOR: #000000; TEXT-DECORATION: underline
}
.style10 {font-size: 9pt; font-weight: bold; }
.style7 {font-size: 9pt}
.style8 {color: #4F4B49}



.bleft {
	background-image: url(//img.testcombats.ru/forumsimg/left.png);
    background-repeat: repeat-x;
    background-position: bottom;
}
.btitle {
    background-image: url(//img.testcombats.ru/forumsimg/top_line.png);
    background-repeat: repeat-x;
    background-position: bottom;
	text-align: center;
    color: white;
    font-size: 8pt;
    font-weight: bold;
    padding-top: 10px;
}
.bright {
	background-image: url(//img.testcombats.ru/forumsimg/right.png);
    background-repeat: repeat-x;
    background-position: bottom;
}	

.bmleft {
	background-image: url(//img.testcombats.ru/forumsimg/leftl.png);
}

.bmright {
	background-image: url(//img.testcombats.ru/forumsimg/rightl.png);
}

.bm1left {
	background-image: url(//img.testcombats.ru/forumsimg/leftd.png);
    background-repeat: repeat-x;
    background-position: bottom;
}
.bm1title {
    background-image: url(//img.testcombats.ru/forumsimg/bottom_line.png);
    background-repeat: repeat-x;
    background-position: bottom;
	text-align: center;
    color: white;
    font-size: 8pt;
    font-weight: bold;
    padding-bottom: 10px;
}
.bm1right {
	background-image: url(//img.testcombats.ru/forumsimg/rightd.png);
    background-repeat: repeat-x;
    background-position: bottom;
}

.fade {
  opacity: 1;
}

.fade:hover {
  opacity: 0.6;
}

.fnts {
	font-size: 8pt;
}
</style>
<script LANGUAGE='JavaScript'>
document.ondragstart = test;
//запрет на перетаскивание
document.onselectstart = test;
//запрет на выделение элементов страницы
document.oncontextmenu = test;
//запрет на выведение контекстного меню
function test() {
 return false
}
</SCRIPT>
</HEAD>
<BODY bgColor=#000000 leftMargin=0 topMargin=0 marginwidth="0" marginheight="0"><center>
<table width="90%" height="62" border="0" cellpadding="0" cellspacing="0">
<tbody><tr>
<td width="129" class="bleft">&nbsp;</td>
<td align="center" class="btitle">Наш Бойцовский клуб - Быть, а не казаться.</td>
<td width="129" class="bright">&nbsp;</td>
</tr>
</tbody></table>
<table width="90%" border="0" cellpadding="0" cellspacing="0">
  <tr valign=top>
	
	<td align=center>
		<table cellspacing=0 cellpadding=0 width="95%" border=0>
		<tr valign=top>
		<td width="23" class="bmleft">&nbsp;</td>
		<td width="1" bgcolor="#F2E5B1">&nbsp;</td>
		<td bgcolor="#f2e5b1"></td>
		<td rowspan=2 bgcolor="#f2e5b1" style="padding-left: 10px;">
    <h3 style="padding-left: 125px;"><br>Соглашение о предоставлении сервиса игры "Наш Бойцовский Клуб"</h3>
    <table width="100%" border="0" cellspacing="0" cellpadding="0">

 <tr>
 <td>
 <strong style="padding-left: 10px;"><a href="#">Содержание</a> / <a href="2.php"> Соглашение о предоставлении сервиса игры "Наш Бойцовский Клуб"</a> /</strong></td>
 </tr>
 <tr>
 <td>
<ul>

	<li>Vector MS Ltd., именуемое в дальнейшем <B>"Администрация"</B>, предлагает на приведенных ниже условиях заключить настоящее Соглашение с физическим лицом, именуемым в дальнейшем "Пользователь", выразившим согласие с условиями настоящего Соглашения.</li>

	<li>Принимая условия настоящего Соглашения, Пользователь выражает согласие со всеми его условиями. Согласие Пользователя с положениями настоящего Соглашения является обязательным условием для начала использования Игры "OURCOMBATS" (далее- "Игра").</li>

	<li>Текст настоящего Соглашения может быть изменен Администрацией без специальных уведомлений Пользователя путем опубликования актуальной версии Соглашения на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>
	
	<li>Пользователь, принимая условия настоящего Соглашения, подтверждает, что он правоспособен и дееспособен и вправе заключать настоящее Соглашение.</li>
	
	<li>Пользователь гарантирует, что используемое им оборудование и средства связи, в том числе используемые Пользователем услуги оператора связи являются достаточными и исправными для участия в Игре.</li>
	
	<li>Права разработчиков и владельцев Игры, размещенной на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> принадлежат на правах собственности Администрации и защищаются законодательством Российской Федерации и нормами международного права об охране интеллектуальной собственности и авторских правах. Настоящее Соглашение разработано специально для игры "OURCOMBATS". Любое распространение текста настоящего Соглашения или его фрагментов может осуществляться только при наличии письменного согласия Администрации.</li>

	<h3>1.	Общие положения</h3>
		<li>1.1. "OURCOMBATS" является игрой, размещенной в сети Интернет по адресу: <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.
		В Игре "OURCOMBATS" одновременно могут принимать участие большое количество пользователей.</li>
		
		<li>1.2 Администрация обязуется обеспечить без взимания платы доступ Пользователя к Игре. Пользователь самостоятельно за свой счет оплачивает доступ в сеть Интернет.
		Администрация предоставляет Пользователю дополнительный платный сервис, перечень которого определяется настоящим Соглашением или Приложениями к нему. Порядок и условия пользования платным сервисом определены в Разделе 5 настоящего Соглашения.</li>
		
		<li>1.3. Описание Игры, а также ее правила изложены в разделе сайта <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> "Правила игры "OURCOMBATS", составляют неотъемлемую часть настоящего Соглашения и обязательны для исполнения Пользователем.</li>
		
		<li>1.4. "Пользователем" игры является любое лицо, получившее доступ к игре в соответствии настоящим соглашением, использующее материалы, размещенные на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>, в частном порядке, только в личных целях.</li>
		
		<li>1.5. "Материалами" или "компонентами" игры являются любой текст, фотографические изображения, образы, графика, а также любые данные в визуальной, аудио или аудиовизуальной, либо иной форме, находящиеся на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>. Также под этим термином следует понимать любые материалы, размещенные на каком-либо ином вэб-сайте или вэб-странице, имеющей ссылку на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>

		<h3>2.  Предмет Соглашения</h3>
		<li>2.1. В соответствии с условиями настоящего Соглашения Администрация предоставляет Пользователю использование Игры "OURCOMBATS" в соответствии с правилами игры круглосуточно, за исключением времени проведения профилактических работ и иных обстоятельств, препятствующих Пользователю осуществить доступ к Игре, возникших не по вине Администрации.</li>
		
		<li>2.2. Пользователь обязуется соблюдать условия настоящего Соглашения.</li>
		
		<li>2.3. С момента принятия условия Пользователем на него распространяются все условия Соглашения.</li>
		
		<li>2.4. В случае нарушения Пользователем настоящего Соглашения Администрация вправе отказать ему в дальнейшем использовании Игры.</li>
		
		<li>2.5. Информация, размещаемая на сайтах <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>, является официальной информацией Администрации, обязательной для исполнения каждым Пользователем, заключившего настоящее Соглашение.</li>
		
		<li>2.6. Лица, не достигшие совершеннолетия, обязаны согласовать использование Игры со своими законными представителями (родители, опекуны и т.д.). Пользование несовершеннолетними дополнительным (платным) сервисом Игры осуществляется на условиях, определенных в разделе 5 настоящего Соглашения.</li>

		<h3>3.	Права и обязанности Пользователя</h3>
		<h4>3.1. Права Пользователя</h4>
		<li>3.1.1. Пользователь имеет право пользоваться Игрой исключительно в некоммерческих личных целях в соответствии с правилами Игры.</li>
		
		<li>3.1.2. При регистрации Пользователь выбирает себе логин и пароль, который позволит идентифицировать Пользователя среди других пользователей Игры. Для доступа к платному сервису Пользователь обязан сообщить Администрации следующие достоверные данные о себе: дата рождения, адрес электронной почты.</li>
		
		<li>3.1.3. Пользователь имеет право на изменение своего пароля. При этом Пользователь обязан самостоятельно обеспечивать неразглашение (тайну) своего пароля и иных необходимых данных и соответственно несет ответственность за сохранение и неразглашение своего пароля, а так же все риски (убытки), связанные с этим.</li>
		
		<li>3.1.4. Пользователь вправе зарегистрировать только одного персонажа. Пользователь не имеете права передавать свою регистрацию (логин и пароль) третьему лицу, а также не имеете права получать его от третьего лица.</li>
		
		<li>3.1.5. Пользователь может направить претензии и предложения связанные с использованием Игры письменно, либо по электронной почте по адресам, указанным на сайте <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>
		
		<h4>3.2. Обязанности Пользователя</h4>
		<li>3.2.1. По требованию Администрации Пользователь обязан сообщить о себе достоверную информацию, позволяющую идентифицировать владельца персонажа.</li>
		
		<li>3.2.2. Пользователь имеет право осуществлять использование платного сервиса только через уполномоченных представителей Администрации (Дилеров). В случае если Пользователю станет известно о незаконных операциях (не через дилеров), он обязан немедленно сообщить об этом Администрации.</li>
		
		<li>3.2.3. Пользователь обязан в случае необходимости совершения каких-либо действий, связанных с использованием Игры удостовериться, что он вступает в правоотношения с уполномоченным на то представителем Администрации. Каждый уполномоченный представитель имеет специальный отличительный знак, описание которого находится на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>
		
		<li>3.2.4. Пользователь не имеет права использовать баги (ошибки программного обеспечения) и обязан незамедлительно сообщать о них Администрации, вмешиваться в программный код, несанкционированно получать доступ к компьютерной системе, получать, без надлежащего разрешения Администрации, доступ к базе данных пользователей игры или материалов <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>
		
		<li>3.2.5. Пользователь не имеет право распространять информацию, направленную на незаконное получение паролей доступа к персонажам Игры "OURCOMBATS", а так же распространять ссылки на сайты с подобной информацией.</li>
		
		<li>3.2.6. Пользователь обязуется уважительно и корректно относиться к другим пользователям Игры, а именно: не использовать ненормативную лексику, не угрожать насилием и физической расправой за пределами Игры; не распространять каким - либо образом материалы, пропагандирующие, либо выражающие неприятие или ненависть к какой - либо религии, культуре, расе, нации, народу, языку, политике, идеологии или общественному движению; не рекламировать порно-сайты, наркотики и ресурсы, содержащие подобную информацию, а также совершать иные подобные действия.</li>
		
		<li>3.2.7. Пользователь не вправе ограничивать доступ других Пользователей к Игре или препятствовать другим Пользователям в использовании Игры.</li>
		
		<li>3.2.8. Пользователь обязуется не передавать любую информацию или программное обеспечение, которое содержит в себе вирусы или иные вредные компоненты, а также совершать иные действия, которые противоречат нормам действующего права Российской Федерации или международного права.</li>
		
		<li>3.2.9. Пользователю запрещается копирование, воспроизводство, распространение и перевод на другие языки любого компонента Игры без письменного разрешения Администрации. Пользователь признает и соглашается с тем, что любой материал и все необходимые программы, связанные с Игрой "OURCOMBATS", защищены законами об интеллектуальной собственности Российской Федерации и прочими международными законами, а контент, предоставляемый Пользователю в процессе использования Игры "OURCOMBATS", защищен авторскими правами, торговыми марками, патентами и прочими соответствующими законами. Пользователь не имеет право модифицировать, продавать, распространять этот контент, материал Игры и программы, целиком либо по частям. Администрация предоставляет Пользователю личное неисключительное и непередаваемое право использовать контент, материал Игры и программное обеспечение, предоставляемое в Игре "OURCOMBATS", в соответствии с правилами Игры, при условии, что ни Пользователь, ни любые иные лица при содействии со стороны Пользователя не будут копировать или изменять контент и программное обеспечение; создавать программы, производные от программного обеспечения; проникать в программное обеспечение с целью получения кодов программ; осуществлять продажу, уступку, сдачу в аренду, передачу третьим лицам в любой иной форме прав в отношении материала Игры и программного обеспечения Игры, а также модифицировать сервис, в том числе с целью получения несанкционированного доступа к нему.</li>
		
		<li>3.2.10. Пользователь соглашается, что в случае нарушения им своих обязанностей Администрация вправе в любой момент применить к нему санкции, выражающиеся в запрете Пользователю пользоваться Игрой, либо использовать к нему иные методы воздействия: предупреждение, временное блокирование пользования Игрой, требование о возмещении убытков и иные действия.</li>
		
		<h3>4. Права и обязанности Администрации</h3>
		<li>4.1. Администрация обязуется не разглашать преднамеренно информацию о Пользователе, данную им при регистрации, третьим лицам кроме случаев, предусмотренных законодательством Российской Федерации и нормами международного права, а так же не изменять логин и пароль Пользователя без его согласия. Администрация не рассылает пользователям необоснованные электронные или иные сообщения (спам); в случае, если пользователь получил от Администрации такое сообщение, ему следует незамедлительно известить об этом представителей Администрации.</li>
		
		<li>4.2. Администрация не несет ответственности за временные технические сбои и перерывы в работе Игры, за временные сбои и перерывы в работе линий связи, иные аналогичные сбои, а также за неполадки компьютера, с которого Пользователь осуществляет выход в Интернет.</li> 
		
		<li>4.3. Администрация не несет ответственности за убытки, понесенные в результате использования или не использования Пользователем информации об Игре.</li>
		
		<li>4.4. Администрация обязуется обеспечивать исправность программных средств, используемых для приема информации о передаче денежных средств.</li>
		
		<li>4.5. Администрация имеет право в одностороннем порядке уменьшать игровой счет Пользователя при обнаружении недобросовестности действий Пользователя, приведших к необоснованному увеличению его игрового счета.</li>
		
		<li>4.6. Администрация не несет ответственности перед Пользователем за действия других пользователей.</li>
		
		<li>4.7. Администрация имеет право на удаление или изменение любой информации, размещенной Пользователем на <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> без предварительного согласования с Администрацией или не предусмотренной настоящим Соглашением, а также иными соглашениями с Администрацией.</li>

		<h3>5. Платные услуги Игры "OURCOMBATS"</h3>
		<li>5.1. Пользователь имеет право по своему усмотрению пользоваться платным сервисом Игры.</li>
		
		<li>5.2. Платным сервисом Игры вправе пользоваться дееспособные Пользователи, достигшие возраста совершеннолетия. Лица, не достигшие возраста совершеннолетия, вправе пользоваться платным сервисом Игры в порядке и на условиях, определенных действующим законодательством Российской Федерации и нормами международного права.</li>
		
		<li>5.3. Использование дополнительного (платного) сервиса Игры "OURCOMBATS" осуществляется на основании настоящего соглашения в порядке определенном в правилах Игры "OURCOMBATS".</li>
		
		<li>5.4. Платный сервис может приобретаться только у лиц, имеющих разрешение Администрации на реализацию данных услуг (Дилеры). Пользователь несет все риски, связанные с приобретением им каких-либо услуг в нарушение порядка и условий, определенных настоящим Соглашением.</li>
		
		<li>5.5. Пользователь допускается к платному сервису с момента оплаты платного сервиса.</li>
		

		<h3>6. Особые условия.</h3>
		<li>6.1. Администрация не гарантирует, что программное обеспечение Игры не содержит ошибок или будет функционировать бесперебойно.</li>
		
		<li>6.2. Администрация не несет ответственности за убытки или иной вред, возникший у Пользователя в связи с действиями третьих лиц, в том числе из-за действий бывших сотрудников Администрации.</li>
		
		<li>6.3. Администрация оставляет за собой право удалять со своих серверов любую информацию или материалы, которые, по мнению Администрации, являются неприемлемыми, нежелательными или нарушающими настоящее Соглашение.</li>
		
		<li>6.4. Администрация вправе в одностороннем порядке и в любое время ограничить, расширить или изменить качество услуг без предварительного уведомления Пользователя.</li>
		
		<li>6.5. Администрация вправе в одностороннем порядке и в любое время изменять условия настоящего Соглашения. Изменения вступают в силу с момента опубликования их на сайте Игры <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>, либо с иного момента, установленного Администрацией.</li>
		
		<li>6.6. Настоящее Соглашение регулируется нормами законодательства Российской Федерации и нормами международного права. Споры, возникающие из настоящего Соглашения, подлежат разрешению путем переговоров. В случае не урегулирования спора во внесудебном порядке, он передается на разрешение в соответствующий судебный орган, определяемый в соответствии с законодательством Российской Федерации, если иное не предусмотрено нормами международного права.</li>

		<h3>7. Вступление в силу и срок действия Соглашения</h3>
		<li>7.1. Настоящее Соглашение вступает в силу при акцептации его Пользователем на сайте <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> путем выбора и нажатия Пользователем опции "согласен" (или иной аналогичной опции). Пользователь соглашается, что выбор им вышеуказанной опции означает, что он предварительно и в полном объеме ознакомился с условиями настоящего Соглашения и принимает их без каких-либо исключений.</li>
		
		<li>7.2. Соглашение заключается на неопределенный срок.</li>
		
		<li>7.3. Администрация вправе в одностороннем порядке отказаться от настоящего Соглашения и прекратить предоставление услуг по пользованию Игрой без возмещения убытков с предварительным уведомлением Пользователя расторжении Соглашения не менее, чем за 1 месяц. Информирование может быть произведено путем опубликования данной информации на сайте <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>.</li>
		
		<li>7.4. Все изменения, дополнения, приложения к настоящему Соглашению или иная информация являются неотъемлемой его частью и являются обязательными для исполнения с момента опубликования их на сайте <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A>, если иное не установлено Администрацией.</li>
		
		<li>7.5. Настоящее Соглашение составлено на русском и английском языках. В случае разногласий по существу Соглашения приоритетным является текст на русском языке. Официальным языком сайта <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> является русский язык, официальным языком сайта <a href='testcombats.ru'>"Наш Бойцовский Клуб"</A> - английский.</li>
		
		<H4>Контактная информация</H4>
		Vector MS Ltd.<BR>
		admin@testcombats.ru - Администрация<BR>
		support@testcombats.ru - Технический Отдел<BR><br><br>
 </ul></td><br>
 </tr>
 </table>
 <td width="139" bgcolor="#F2E5B1"><table width="100%" border="0" cellpadding="0" cellspacing="0" style="height:100%; ">
</table>
<!-- End of text -->
</td>
<td width="23" class="bmright">&nbsp;</td>
</tr>
</table>
</td>

</tr>
</table>
<table width="90%" height="62" border="0" cellpadding="0" cellspacing="0">
		      <tbody><tr>
		        <td width="129" class="bm1left">&nbsp;</td>
		        <td class="bm1title"><!--LiveInternet counter--><a href="//www.liveinternet.ru/click"
target="_blank"><img id="licntC407" width="80" height="31" style="border:0" 
title="LiveInternet: показано число просмотров за 24 часа, посетителей за 24 часа и за сегодня"
src="data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAEALAAAAAABAAEAAAIBTAA7"
alt=""/></a><script>(function(d,s){d.getElementById("licntC407").src=
"//counter.yadro.ru/hit?t13.2;r"+escape(d.referrer)+
((typeof(s)=="undefined")?"":";s"+s.width+"*"+s.height+"*"+
(s.colorDepth?s.colorDepth:s.pixelDepth))+";u"+escape(d.URL)+
";h"+escape(d.title.substring(0,150))+";"+Math.random()})
(document,screen)</script><!--/LiveInternet--> <a href="https://rpgtop.su/26325" title="Рейтинг Ролевых Ресурсов - RPG TOP" target="_blank">
            <img src="//img.rpgtop.su/88x31x11x8.gif" alt="Рейтинг Ролевых Ресурсов - RPG TOP" width="88" height="31" border="0"></a></td>
		        <td width="129" class="bm1right">&nbsp;</td>
		      </tr>
</tbody></table></center>
</BODY>
</HTML>