    <div class="container">

            <?php include './templates/'.$template.'/blocks/menu-top-home.php'; ?>

            <div class="row  page-home mt-100 mb-100 ">                
                <div class="col-12">
                    <h2 class="text-center">КАК ЗДЕСЬ ЗАРАБАТЫВАЮТ?</h2>
                    
                    <p class="mt-25">
                         - это партнерская рекламная сеть, работающая по модели Сost-Per-Action (оплата-за-действие). В нашей сети веб-мастера приводят трафик на сайты партнеров из множества разных источников. Вебмастера зарабатывают на арбитраже трафика, партнеры получают большое количество целевых действий (заказов, регистраций, оплат) по выгодной цене.
                        <br><br>
                        Заработки вебмастеров доходят до десятков тысяч долларов, рекламодатели получают сотни и тысячи новых клиентов. Присоединяйтесь, и зарабатывайте с нами!
                    </p>
                    
                    
                </div>    
            </div>

    </div>


        
    <!-- BEGIN FOOTER -->
        <?php include './templates/'.$template.'/blocks/footer.php'; ?>
    <!-- END FOOTER -->
    
        




    