<?php
########################################################
#	ankets-reset-processing.php
#
#	Сброс статуса "обрабатывается" для анкет
#	Подразумевается, что этот скрипт будет запущен при
#	перезагрузке сервера (т.е., чтобы задача не висела
#	в зомби-процессах)
#
#	Автор: Ашмарин Илья, mail[at]harduino.com
#
#	История:
#			2017.11.20 - файл создан
#
########################################################
#
	define( 'CRON_MODE', true );
	require_once dirname(__FILE__).'/../init/init.cron.php';
	$cron->run_task( 'ankets-reset-processing' );
#
########################################################
?>
