    <div class="container">

            <?php include './templates/'.$template.'/blocks/menu-top-home.php'; ?>

            <div class="row  page-home mt-50 mb-50 ">
                <div class="col-12">
                    <h2 class="text-center">О КОМПАНИИ</h2>

                    <p class="mt-25">
                        BlackDollar – платформа рекламодателей, предлагающая выгодные условия сотрудничества для вебмастеров и партнеров. Наша деятельность основана на работе модели cost-per-action – это перспективная модель, которая демонстрирует высокие показатели и успешно используется крупными агрегаторами партнерских программ. Работа по такой схеме выгодна всем сторонам и, в первую очередь, партнерам, т.к. оплата происходит только за действие: за регистрацию, покупки или звонки. Это позволяет добиться высокой эффективности и создать качественную рекламу, привлекающую целевую аудиторию.
                        <br><br>
                        BlackDollar – снижение рисков и получение результата в кратчайшие сроки.
                        <br><br>
                        <b>Как это работает?</b>
                        <br>
                        Вебмастера обеспечивают трафик с различных ресурсов на партнерские сайты, а рекламодатели получают приток новой целевой аудитории, новых заказов и оплаты.
                        <br>
                        В среднем вебмастера получают от $10 000, а партнерские сайты – трафик пользователей на свой ресурс.
                        <br><br>
                        Наши преимущества:
                        <br>
                        - прибыльные офферы;<br>
                        - досрочные выплаты;  <br>
                        - высокая конверсия;<br>
                        - статистика; <br>
                        - компенсации;<br>
                        - круглосуточная поддержка;<br>
                        - акции и бонусы.<br>
                        <br><br>
                        Вы вебмастер? Наша компания предлагает вам десятки выгодных партнерских программ, поддержку, статистику и достойную оплату. Становитесь нашим партнером уже сегодня!
                        <br><br>
                        Вы рекламодатель? Наша компания гарантирует приток новых пользователей, повышение уровня продаж, охват только целевой аудитории, оплату услуги за конкретное действие – для начала работы с нами не нужно предварительных взносов, вы оплачиваете по факту.
                    </p>


                </div>
            </div>

    </div>



    <!-- BEGIN FOOTER -->
        <?php include './templates/'.$template.'/blocks/footer.php'; ?>
    <!-- END FOOTER -->
