<?php


use Illuminate\Database\Seeder;
use App\Page;

class PageTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
		$page1 = Page::create(['name' => 'Главная', 'description' => 'Цель компании «Инвестрика» - умножение капитала наших инвесторов и развитие бизнеса в России. Мы предоставляем возможность инвестировать в проекты, прошедшие качественный скоринг. Наш сервис — надежный и удобный инструмент.']);
		$page2 = Page::create(['name' => 'Промышленность', 'description' => 'Выбирая промышленный сектор для инвестирования, Вы можете расчитывать на долгосрочный пассивный доход. Процентная ставка от 20% годовых. На нашем сайте мы отобрали для Вас лучшие производственные компании.']);
		$page3 = Page::create(['name' => 'Торговая сеть', 'description' => 'Добавляя в свой портфель инвестора компанию, связанную с торговлей, Вы поддерживаете малый бизнес в России. Проинвестировав в торговую сеть, мы стимулировали её рост и торговый оборот.']);
		$page4 = Page::create(['name' => 'IT компания', 'description' => 'Немногие IT компании проходят наш скоринг и систему оценки рисков. Среди многих представителей мы находим только самых перспективных представителей отрасли. IT сектор - один из самых быстро растущих направлений в бизнесе.']);
		
		/*if ($image1) $category1->images()->attach($image1);
		if ($image7) $category1->images()->attach($image7);*/

    }
}
