<?php
########################################################
#	constants.static.php
#
#	Статические данные
#
#	Автор: Ашмарин Илья, mail[at]harduino.com
#
#	История:
#			2017.11.01 - файл создан
#
########################################################
$GLOBALS['LISTS'] += array(

	'subdomains'	=> array(
		'hosts'	=> array(
			'www'		=> array()
		),
		'aliases'	=> array(
			'lk'		=> 'www',
			'my'		=> 'www',
			'join'		=> 'www',
			'download'	=> 'www'
		),
		'force_lang'	=> array(
			'.ru'	=> 'ru',
			'.com'	=> 'en',
			'.work'	=> 'en'
		)
	),
	'months'	=> array(
		'data'	=> array(
			'1'		=> 'Январь',
			'2'		=> 'Февраль',
			'3'		=> 'Март',
			'4'		=> 'Апрель',
			'5'		=> 'Май',
			'6'		=> 'Июнь',
			'7'		=> 'Июль',
			'8'		=> 'Август',
			'9'		=> 'Сентябрь',
			'10'	=> 'Октябрь',
			'11'	=> 'Ноябрь',
			'12'	=> 'Декабрь'
		),
		'dow'	=> array(
			'1'	=> 'Понедельник',
			'2'	=> 'Вторник',
			'3'	=> 'Среда',
			'4'	=> 'Четверг',
			'5'	=> 'Пятница',
			'6'	=> 'Суббота',
			'7'	=> 'Воскресенье',
		)
	)

);
#
########################################################
?>
