<?php
########################################################
#	constants.users.php
#
#	Статические данные, связанные с пользователями
#
#	Автор: Ашмарин Илья, mail[at]harduino.com
#
#	История:
#			2017.11.01 - файл создан
#
########################################################
$GLOBALS['LISTS'] += array(

	'users' => array(
		'statuses'			=> array(
			'active'		=> 'активный',
			'moderating'	=> 'неактивирован',
			'blocked'		=> 'заблокированный'
		),
		'types'	=> array(
			'user'	=> 'пользователь',
			'admin'	=> 'администратор'
		)
	),

);
#
########################################################
?>
