<?
/*
Template name: О проекте
*/
?>
<? get_header(); ?>
<section class="main_slider">
			<div class="container-custom">
				<div class="row">
					<div class="col-lg-12">
						<div class="mission">
							<h1>Миссия проекта</h1>
							<p>Формирование уникальной среды, развивающей лидерские и творческие способности обучающихся в новом формате, направленном на взаимодействие студентов и аспирантов, преподавателей, тренеров, представителей бизнес сообщества и органов государственной власти в рамках разработки и внедрения социально-значимых проектов на стыке областей знания.</p>
						</div>		
					</div>
				</div>
			</div>
		</section>
		<section class="goals">
			<div class="container">
				<div class="row">
					<div class="col-md-3 text-right">
						<h2>Цель<br>проекта</h2>
					</div>
					<div class="col-lg-9 goal">
						<p>Решение проблем недостаточного охвата общекультурных компетенций в образовательных
программах высших учебных заведений, необходимых для успешной реализации выпускников
на рабочем месте, в социальных и бизнес проектах, направленных на социально-экономический
рост Российской Федерации в условиях конкуренции на мировой арене. Основные целевые
группы проекта - это студенты высших учебных заведений - бакалавры, специалисты,
магистранты и аспиранты.</p>
					</div>
				</div>
			</div>
		</section>
		<section class="goals2">
			<div class="container">
				<div class="row">
					<div class="col-md-6">
						<img src="<? echo get_template_directory_uri(); ?>/images/about/img1.png" style="width: 100%;">
						<h3>Повышение мотивации</h3>
						<p>Сформировать у школьников, студентов и
заинтересованных граждан позитивное отношение
к созидательному инженерному труду, актуальности
и востребованности специальностей нефтегазового
комплекса и патриотическим аспектам развития
нефтегазовой промышленности</p>
					</div>
					<div class="col-md-6" style="width: 100%;">
						<h3>Формирование интереса</h3>
						<p>Предоставить обучающимся актуальные знания в
области поиска, разведки, бурения, добычи,
транспортировки и переработки углеводородов
от ведущих преподавателей Российского
государственного университета нефти и газа
(национального исследовательского университета)
имени  И.М. Губкина</p>
						<img src="<? echo get_template_directory_uri(); ?>/images/about/img2.png">
					</div>
				</div>
			</div>
		</section>
		<section class="blocks">
			<div class="container">
				<div class="row">
					<div class="col-md-12">
						<h2>Блоки проекта</h2>
					</div>
					<div class="col-md-4">
						<div class="block block-l">
							<div class="layer">
								<h3>Личность</h3>
								<p>Включает следующую тематику:
презентации, выступления, деловой
этикет, резюме, собеседования,
психодиагностика, профориентация,
формирование стрессоустойчивости,
построение карьеры, иностранные
языки: отраслевые аспекты, дизайн
помещений, ландшафтный дизайн,
архитектура, национальные кухни,
физическое совершенство и
здоровый образ жизни.</p>
							</div>
						</div>
					</div>
					<div class="col-md-4">
						<div class="block block-b">
							<div class="layer">
								<h3>Бизнес</h3>
								<p>Включает следующую тематику:
экономика, бухгалтерский учёт,
налогообложение, нормирование,
себестоимость, снабжение и
стратегический и риск-менеджмент,
управление проектами, малое
предпринимательство, инновации,
корпоративное обеспечение бизнеса,
планирование производства.</p>
							</div>
						</div>
					</div>
					<div class="col-md-4">
						<div class="block block-p">
							<div class="layer">
								<h3>Профессия</h3>
								<p>Включает следующую тематику:
нефтегазовое производство,
технологические цепочки,
товароведение в нефтегазовой
отрасли, отраслевые рынки,
компьютерные технологии, прогноз
развития энергетики, топливно-
энергетический баланс (России
и основных стран-участников),
возобновление источников энергии,
новые виды углеводородных ресурсов.</p>
							</div>
						</div>
					</div>
				</div>
			</div>
		</section>
		<section class="last">
			<div class="container">
				<div class="row">
					<div class="col-md-12 text-center">
						<p>
							<img src="<? echo get_template_directory_uri(); ?>/images/qub.png">
							<img src="<? echo get_template_directory_uri(); ?>/images/about/logo2.png">
						</p>
						<h3>Образовательный проект осуществлен благодаря<br> 
финансовой поддержке  «РОСМОЛОДЁЖЬ»</h3>
						<p>&copy; Все правы защищены и принадлежат Российскому государственному университету
нефти и газа  (национальному исследовательскому университету) имени И.М. Губкина</p>
					</div>
				</div>
			</div>
		</section>
<? get_footer(); ?>