<?php

$sr = array();
//Госмаг
$sr[1][1] = 'Кастеты,ножи';
$sr[1][2] = 'Топоры';
$sr[1][3] = 'Дубины,булавы';
$sr[1][4] = 'Мечи';
$sr[1][5] = 'Магические посохи';
$sr[1][6] = 'Сапоги';
$sr[1][7] = 'Перчатки';
$sr[1][8] = 'Рубахи';
$sr[1][9] = 'Легкая броня';
$sr[1][10] = 'Тяжелая броня';
$sr[1][11] = 'Шлемы';
$sr[1][12] = 'Наручи';
$sr[1][13] = 'Пояса';
$sr[1][14] = 'Поножи';
$sr[1][15] = 'Щиты';
$sr[1][16] = 'Серьги';
$sr[1][17] = 'Ожерелья';
$sr[1][18] = 'Кольца';
$sr[1][19] = 'Нейтральные';
$sr[1][20] = 'Боевые и защитные';
$sr[1][21] = 'Пирожки';
$sr[1][22] = 'Заклинания: Исцеляющие';
$sr[1][23] = 'Заклинания: Манящие';
$sr[1][26] = 'Сервисные';
$sr[1][27] = 'Амуниция';
$sr[1][28] = 'Эликсиры';
$sr[1][29] = 'Еда';
$sr[1][30] = 'Подарки';
$sr[1][31] = 'Недобрые';
$sr[1][32] = 'Упаковка';
$sr[1][33] = 'Открытки';
$sr[1][34] = 'Фейерверки';
$sr[1][35] = 'Усиление оружия: заточки';



//Березка
$sr[2][1] = 'Кастеты,ножи';
$sr[2][2] = 'Топоры';
$sr[2][3] = 'Дубины,булавы';
$sr[2][4] = 'Мечи';
$sr[2][5] = 'Магические посохи';
$sr[2][6] = 'Сапоги';
$sr[2][7] = 'Перчатки';
$sr[2][8] = 'Рубахи и футболки';
$sr[2][9] = 'Легкая броня';
$sr[2][10] = 'Тяжелая броня';
$sr[2][11] = 'Шлемы';
$sr[2][12] = 'Наручи';
$sr[2][13] = 'Пояса';
$sr[2][14] = 'Поножи';
$sr[2][15] = 'Щиты';
$sr[2][16] = 'Серьги';
$sr[2][17] = 'Ожерелья';
$sr[2][18] = 'Кольца';
$sr[2][19] = 'Нейтральные';
$sr[2][20] = 'Боевые и защитные';
$sr[2][21] = 'Амуниция';
$sr[2][22] = 'Эликсиры';
$sr[2][23] = 'Подарки';
$sr[2][24] = 'Недобрые';
$sr[2][25] = 'Упаковка';
$sr[2][26] = 'Открытки';
$sr[2][27] = 'Фейерверки';
$sr[2][28] = 'Плащи';
$sr[2][29] = 'Капюшоны';
$sr[2][30] = 'Еда';
$sr[2][31] = 'Чеки';
$sr[2][32] = 'Руны';
$sr[2][33] = 'Чарки';
$sr[2][34] = 'Тактики';
$sr[2][35] = 'Книги';
$sr[2][36] = 'Сундуки';
$sr[2][37] = 'Заклинания: Исцеляющие';
$sr[2][38] = 'Заклинания: Манящие';
$sr[2][39] = 'Заклинания: Благославление';
$sr[2][40] = 'Заклинания: Тактические';
$sr[2][41] = 'Заклинания: Усиления';




//Березка
$sr[777][1] = 'Кастеты,ножи';
$sr[777][2] = 'Топоры';
$sr[777][3] = 'Дубины,булавы';
$sr[777][4] = 'Мечи';
$sr[777][5] = 'Магические посохи';
$sr[777][6] = 'Сапоги';
$sr[777][7] = 'Перчатки';
$sr[777][8] = 'Рубахи';
$sr[777][9] = 'Легкая броня';
$sr[777][10] = 'Тяжелая броня';
$sr[777][11] = 'Шлемы';
$sr[777][12] = 'Наручи';
$sr[777][13] = 'Пояса';
$sr[777][14] = 'Поножи';
$sr[777][15] = 'Щиты';
$sr[777][16] = 'Серьги';
$sr[777][17] = 'Ожерелья';
$sr[777][18] = 'Кольца';
$sr[777][19] = 'Нейтральные';
$sr[777][20] = 'Боевые и защитные';
$sr[777][21] = 'Амуниция';
$sr[777][22] = 'Эликсиры';
$sr[777][23] = 'Подарки';
$sr[777][24] = 'Недобрые';
$sr[777][25] = 'Упаковка';
$sr[777][26] = 'Открытки';
$sr[777][27] = 'Фейерверки';
$sr[777][28] = 'Плащи и накидки';
$sr[777][29] = 'Капюшоны';


//Универмаг
$sr[609][1] = 'Кинжалы,ножи';
$sr[609][2] = 'Топоры';
$sr[609][3] = 'Дубины,булавы';
$sr[609][4] = 'Мечи';
$sr[609][5] = 'Магические посохи';
$sr[609][6] = 'Сапоги';
$sr[609][7] = 'Перчатки';
$sr[609][8] = 'Рубахи и футболки';
$sr[609][9] = 'Легкая броня';
$sr[609][10] = 'Тяжелая броня';
$sr[609][11] = 'Шлемы';
$sr[609][12] = 'Наручи';
$sr[609][13] = 'Пояса';
$sr[609][14] = 'Поножи';
$sr[609][15] = 'Щиты';
$sr[609][16] = 'Серьги';
$sr[609][17] = 'Ожерелья';
$sr[609][18] = 'Кольца';
$sr[609][19] = 'Нейтральные';
$sr[609][20] = 'Боевые и защитные';
$sr[609][21] = 'Амуниция';
$sr[609][22] = 'Эликсиры';
$sr[609][23] = 'Подарки';
$sr[609][24] = 'Недобрые';
$sr[609][25] = 'Упаковка';
$sr[609][26] = 'Открытки';
$sr[609][27] = 'Фейерверки';
$sr[609][28] = 'Плащи';
$sr[609][29] = 'Пещерные ресурсы';
$sr[609][30] = 'Еда';
$sr[609][31] = 'Чеки';
$sr[609][32] = 'Руны';
$sr[609][33] = 'Чарки';
$sr[609][34] = 'Тактики';
$sr[609][35] = 'Книги';
$sr[609][36] = 'Сундуки';
$sr[609][37] = 'Заклинания: Исцеляющие';
$sr[609][38] = 'Заклинания: Манящие';
$sr[609][39] = 'Заклинания: Благославление';
$sr[609][40] = 'Заклинания: Тактические';
$sr[609][41] = 'Заклинания: Усиления';

//Прилавок Забытых
$sr[610][6] = 'Сапоги';
$sr[610][7] = 'Перчатки';
$sr[610][8] = 'Рубахи и футболки';
$sr[610][9] = 'Легкая броня';
$sr[610][10] = 'Тяжелая броня';
$sr[610][11] = 'Шлемы';
$sr[610][12] = 'Наручи';
$sr[610][13] = 'Пояса';
$sr[610][14] = 'Поножи';
$sr[610][15] = 'Щиты';
$sr[610][16] = 'Серьги';
$sr[610][17] = 'Ожерелья';
$sr[610][18] = 'Кольца';
$sr[610][21] = 'Амуниция';

//Цветочный магазин
$sr[6][1] = 'Общий зал';
$sr[6][3] = 'Венки';


//Книжный магазин
$sr[3][1] = 'Книги';
$sr[3][2] = 'Приемы атаки';
$sr[3][3] = 'Приемы защиты';
$sr[3][4] = 'Приемы контрударов';
$sr[3][5] = 'Приемы критических ударов';
$sr[3][6] = 'Приемы парирования';
$sr[3][7] = 'Комбо-приемы';
$sr[3][8] = 'Приемы силы духа';
$sr[3][9] = 'Заклинания Огня';
$sr[3][10] = 'Заклинания Воды';
$sr[3][11] = 'Заклинания Воздуха';
$sr[3][12] = 'Заклинания Земли';
$sr[3][13] = 'Заклинания Светлой магии';
$sr[3][14] = 'Заклинания Темной магии';
$sr[3][15] = 'Заклинания Серая магии';

//Елочный магазин
$sr[8][1] = 'Елки';
$sr[8][2] = 'Заклинания';

//Коморка Луки
$sr[5][1] = 'Кастеты,ножи';
$sr[5][2] = 'Топоры';
$sr[5][3] = 'Дубины,булавы';
$sr[5][4] = 'Мечи';
$sr[5][5] = 'Магические посохи';
$sr[5][6] = 'Сапоги';
$sr[5][7] = 'Перчатки';
$sr[5][8] = 'Рубахи';
$sr[5][9] = 'Легкая броня';
$sr[5][10] = 'Тяжелая броня';
$sr[5][11] = 'Шлемы';
$sr[5][12] = 'Наручи';
$sr[5][13] = 'Пояса';
$sr[5][14] = 'Поножи';
$sr[5][15] = 'Щиты';
$sr[5][16] = 'Серьги';
$sr[5][17] = 'Ожерелья';
$sr[5][18] = 'Кольца';
$sr[5][19] = 'Нейтральные';
$sr[5][20] = 'Боевые и защитные';
$sr[5][21] = 'Пирожки';
$sr[5][22] = 'Исцеляющие';
$sr[5][23] = 'Манящие';
$sr[5][24] = 'Стратегические';
$sr[5][25] = 'Тактические';
$sr[5][26] = 'Сервисные';
$sr[5][27] = 'Амуниция';
$sr[5][28] = 'Эликсиры';
$sr[5][29] = 'Еда';
$sr[5][30] = 'Подарки';
$sr[5][31] = 'Недобрые';
$sr[5][32] = 'Упаковка';
$sr[5][33] = 'Открытки';
$sr[5][34] = 'Фейерверки';
$sr[5][35] = 'Усиление оружия: заточки';


//Магазин Таверна
$sr[9][1] = 'Еда';
$sr[9][19] = 'Нейтральные';
$sr[9][20] = 'Боевые и защитные';

//Алтарь Крови
$sr[11][17] = 'Заклинания: Исцеляющие';
$sr[11][18] = 'Заклинания: Манящие';
$sr[11][19] = 'Заклинания: нейтральные';
$sr[11][20] = 'Заклинания: боевые и защитные';
$sr[11][21] = 'Амуниция';
$sr[11][22] = 'Эликсиры';
$sr[11][23] = 'Ресурсы';
$sr[11][24] = 'Поножи [10]';

//Грибница
$sr[17][1] = 'Дубины Булавы';
$sr[17][2] = 'Посохи';
$sr[17][3] = 'Сапоги';
$sr[17][4] = 'Перчатки';
$sr[17][5] = 'Рубахи';
$sr[17][6] = 'Пояса';
$sr[17][7] = 'Кольца';
$sr[17][8] = 'Амуниция';
$sr[17][9] = 'Элексиры';

//Магазин Квилки
$sr[888][6] = 'Сапоги';
$sr[888][7] = 'Перчатки';
$sr[888][8] = 'Рубахи';
$sr[888][9] = 'Легкая броня';
$sr[888][10] = 'Тяжелая броня';
$sr[888][11] = 'Шлемы';
$sr[888][12] = 'Наручи';
$sr[888][13] = 'Пояса';
$sr[888][14] = 'Поножи';
$sr[888][19] = 'Заклинания: Нейтральные';
$sr[888][20] = 'Заклинания: Боевые и защитные';
$sr[888][22] = 'Заклинания: Исцеляющие';
$sr[888][23] = 'Заклинания: Манящие';
$sr[888][24] = 'Заклинания: Стратегические';
$sr[888][25] = 'Заклинания: Тактические';
$sr[888][26] = 'Заклинания: Сервисные';
$sr[888][27] = 'Полезное: Разное';
$sr[888][28] = 'Полезное: Эликсиры';
$sr[888][30] = 'Подарки';
$sr[888][35] = 'Скупка';

//Магазин Бездны
$sr[700][20] = 'Ожерелья';
$sr[700][21] = 'Кольца';

//Магазин ПТП
$sr[701][14] = 'Шлемы';
$sr[701][16] = 'Пояса';
$sr[701][19] = 'Серьги';

//Магазин Катакомбы
$sr[702][15] = 'Наручи';

//Магазин Излома
$sr[10][1] = 'Наручи';
$sr[10][2] = 'Амулеты';
$sr[10][3] = 'Ресурсы';
$sr[10][4] = 'Чарки';

//Магазин Мглы
$sr[703][2] = 'Ножи-Кастеты';
$sr[703][3] = 'Топоры';
$sr[703][4] = 'Дубины Булавы';
$sr[703][5] = 'Мечи';
$sr[703][6] = 'Магические посохи';
$sr[703][12] = 'Легкая Броня';
$sr[703][13] = 'Тяжелая Броня';
$sr[703][18] = 'Щиты';


//Турнирный магазин
$sr[404][1] = 'Нейтральные';
$sr[404][2] = 'Еда';


//Турнирный магазин
$sr[14][1] = 'Кастеты,ножи';
$sr[14][2] = 'Топоры';
$sr[14][3] = 'Дубины,булавы';
$sr[14][4] = 'Мечи';
$sr[14][5] = 'Магические посохи';
$sr[14][6] = 'Сапоги';
$sr[14][7] = 'Перчатки';
$sr[14][8] = 'Рубахи';
$sr[14][9] = 'Легкая броня';
$sr[14][10] = 'Тяжелая броня';
$sr[14][11] = 'Шлемы';
$sr[14][12] = 'Наручи';
$sr[14][13] = 'Пояса';
$sr[14][14] = 'Поножи';
$sr[14][15] = 'Щиты';
$sr[14][16] = 'Серьги';
$sr[14][17] = 'Ожерелья';
$sr[14][18] = 'Кольца';
$sr[14][19] = 'Нейтральные';
$sr[14][20] = 'Боевые и защитные';
$sr[14][21] = 'Амуниция';
$sr[14][22] = 'Эликсиры';
$sr[14][28] = 'Плащи и Накидки';

//Заросшая Кузница
$sr[7][1] = 'Кастеты,ножи';
$sr[7][2] = 'Топоры';
$sr[7][3] = 'Дубины,булавы';
$sr[7][4] = 'Мечи';
$sr[7][5] = 'Магические посохи';
$sr[7][6] = 'Сапоги';
$sr[7][7] = 'Перчатки';
$sr[7][8] = 'Рубахи';
$sr[7][9] = 'Легкая броня';
$sr[7][10] = 'Тяжелая броня';
$sr[7][11] = 'Шлемы';
$sr[7][12] = 'Наручи';
$sr[7][13] = 'Пояса';
$sr[7][14] = 'Поножи';
$sr[7][15] = 'Щиты';
$sr[7][16] = 'Серьги';
$sr[7][17] = 'Ожерелья';
$sr[7][18] = 'Кольца';
$sr[7][19] = 'Нейтральные';
$sr[7][20] = 'Боевые и защитные';
$sr[7][21] = 'Амуниция';
$sr[7][22] = 'Эликсиры';
$sr[7][28] = 'Плащи и Накидки';



//ПТП Рыц Магазин

$sr[801][1] = 'Шлем';
$sr[801][2] = 'Плащ';
$sr[801][3] = 'Заклинание:нейтральные';
$sr[801][4] = 'Книги';
$sr[801][5] = 'Ресурсы';

//Ангел 
$sr[802][1] = 'Сапоги';
$sr[802][2] = 'Плащ';
$sr[802][3] = 'Заклинание:нейтральные';
$sr[802][4] = 'Книги';
$sr[802][5] = 'Ресурсы';
$sr[802][6] = 'Усиления оружия:заточки';

//Каты 
$sr[803][1] = 'Броня';
$sr[803][2] = 'Серьги';
$sr[803][3] = 'Кольца';
$sr[803][4] = 'Плащ';
$sr[803][5] = 'Заклинание: Нейтральные';
$sr[803][6] = 'Книги';
$sr[803][7] = 'Ресурсы';

//Санд 
$sr[804][1] = 'Рубахи';
$sr[804][2] = 'Перчатки';
$sr[804][3] = 'Плащ';
$sr[804][4] = 'Заклинание: Нейтральные';
$sr[804][5] = 'Книги';
$sr[804][6] = 'Ресурсы';

//Эм 
$sr[805][1] = 'Плащ';
$sr[805][2] = 'Книги';



//ID магазинов
$sid = array(

	0 => 'Выберите магазин',
	1 => 'Гос. маг',
	2 => 'Березка',
	777 => 'Магазин артефактов',
	3 => 'Книжный Магазин',
	6 => 'Цветочный магазин',
	7 => 'Заросшая Кузница',
	8 => 'Елочный магазин',
	9 => 'Таверна',
	5 => 'Коморка Луки',
	10=> 'Излом Хаоса',
	11=> 'Алтарь Крови',
	14=> 'Храмовая Лавка',
	17=> 'Грибница',
	609=>'Подпольная Лавка',
	888=>'Магазин Квилки',
	/*700=>'Магазин Бездны',*/
	701=>'Лаборатория Грита',
	702=>'Магазин Катакомбы',
	/*703=>'Магазин Мглы',*/
	404=>'Зоомагазин',
	801=> 'Пещера Тысячи Проклятий',
	802=> 'Бездна',
/* 	


	8 => 'Зоомагазин',
	9 => 'Таверна',
	10=> 'izlomshop',
	
	14=> 'a_hram',
	17=> 'griboed',
	27 => '_shop_referal_',
	33 => 'hrump_shop',
	44 => 'shop_kat',
	45 => 'altar_cat',
	106=> 'Магазин Новичка',
	400=> 'Общий рыцарский магазин dungeon_shop_all',
	404=> 'shop_priz',*/
	609=> 'Универмаг',
	610=> 'Прилавок Забытых',
	700=> 'Наковальня Бездна',
	
	/* 801=> 'Бездна',
	802=> 'Пещера Тысячи Проклятий', */
	803=> 'Катакомбы',
	804=> 'Пещера Мглы',
	805=> 'Потерянный Вход',
	

);


$things = Array(
	0=>'Выберите тип предмета',
	1=>'Шлем',
	2=>'Венок',
	3=>'Наручи',
	4=>'Рубашка',
	5=>'Легкая броня',
	6=>'Тяжелая броня',
	7=>'Плащ',
	8=>'Пояс',
	9=>'Серьги',
	10=>'Амулет',
	11=>'Кольцо',
	12=>'Перчатки',
	13=>'Щит',
	14=>'Поножи',
	15=>'Ботинки',
	16=>'Предмет для карманов',
	17=>'Предмет для смены',
	18=>'Нож \ Кинжал',
	19=>'Топор \ Секира',
	20=>'Молот \ Дубина',
	21=>'Меч \ Клинок',
	22=>'Магический посох',
	23=>'Лук',
	24=>'Арбалет',
	25=>'Боеприпасы \ Стреллы',
	26=>'Костыли',
	27=>'Легендарное оружие',
	28=>'Цветы \ Букеты \ Ёлки',
	29=>'Заклятие',
	30=>'Эликсир',
	31=>'Руна',
	32=>'Ресурс',
	33=>'Мусор',
	34=>'Прочее',
	36=>'Усиление',
	37=>'Упаковка',
	38=>'Подарок',
	39=>'Подарок (требует упаковку)',
	40=>'Книжный прием',
	41=>'Приглашение',
	42=>'Билет',
	43=>'Слот смены',
	44=>'Пергамент (с текстом)',
	45=>'Сумка',
	46=>'Заточка',
	47=>'Усиление 1',
	48=>'Усиление 2 (временное)',
	49=>'Корм для животного',
	60=>'Бумага',
	61=>'Чек',
	62=>'Чарка',
	63=>'Открытка',
);
if(isset($_GET['action']) && $_GET['action']!=''){
	if($_GET['action']=='showItems'){
		$items = mysql_query('SELECT * FROM `items_main` WHERE `type`="'.mysql_real_escape_string($_GET['id']).'" ORDER BY `level` ASC ');
		if(mysql_num_rows($items)){
			while($it = mysql_fetch_array($items)){
				echo'<button class="ui-button ui-corner-all ui-widget" onclick="showDlg('.$it['id'].');" id="item_'.$it['id'].'"><img src="//img.testcombats.ru/i/items/'.$it['img'].'" alt="'.$it['name'].' ['.$it['level'].']" title="'.$it['name'].' ['.$it['level'].']" ></button> ';
			}
		}
	}
	if($_GET['action']=='addItem' && isset($_GET['id']) && $_GET['id']!=''){
		echo 'Добавление в магазин предмета: <b id="itm_id">'.$_GET['id'].'</b><br/>
		Магазин: <select id="sid" onChange="shopItemsSid(this.value)">';
		foreach($sid as $key => $value){
			echo '<option value="'.$key.'">'.$value.'</option>';
		}
		echo'</select>';
		echo'<div id="sidsRazdel"></div>';
	}
	
	if($_GET['action']=='sidsRazdel' && isset($_GET['id']) && $_GET['id']!='' && $_GET['id']!='0'){
		$razdel = $sr[$_GET['id']];
		echo'Раздел: <select id="it_type1" >';
		foreach($razdel as $key => $value){
			echo '<option value="'.$key.'">'.$value.'</option>';
		}
		echo'</select><br/><button onclick="addToShop();">Добавить</button><div id="workMsg" class="workMsg"></div>';
	}
	if($_GET['action']=='addToShop'){
		
		$check = mysql_query('SELECT `iid` FROM `items_shop` WHERE `sid`="'.mysql_real_escape_string($_POST['sid']).'" AND `r`="'.mysql_real_escape_string($_POST['it_type']).'" AND `item_id`="'.mysql_real_escape_string($_POST['itm_id']).'" ;');
		if(mysql_num_rows($check)>0){
			echo'Такой предмет уже существует в разделе данного магазина';
		}
		else{
			
			$itm_info = mysql_fetch_array(mysql_query('SELECT * FROM `items_main` WHERE `id`="'.mysql_real_escape_string($_POST['itm_id']).'" LIMIT 1;'));
			
			mysql_query('INSERT INTO `items_shop` (`item_id`,`kolvo`,`sid`,`r`,`real`,`magic_inc`,`overType`) VALUES ("'.mysql_real_escape_string($_POST['itm_id']).'","1000000000","'.mysql_real_escape_string($_POST['sid']).'","'.mysql_real_escape_string($_POST['it_type']).'","1","'.$itm_info['magic_inci'].'","'.$itm_info['overTypei'].'")');
			//echo'sid:'.$_POST['sid'].'<br>it_type:'.$_POST['it_type'].'<br>itm_id:'.$_POST['itm_id'].'';
			echo'Предмет успешно добавлен';
		}
	}
	die();
}
	echo'<div style="display: inline-flex;"><div>
		<select name="it_type" id="it_type" onChange="shopItems(this.value)">
	';
	foreach($things as $key => $value){
		echo '<option value="'.$key.'">'.$value.'</option>';
	}	
	echo'</select>';
?>
<style>
	#dialog-link {
		padding: .4em 1em .4em 20px;
		text-decoration: none;
		position: relative;
	}
	#dialog-link span.ui-icon {
		margin: 0 5px 0 0;
		position: absolute;
		left: .2em;
		top: 50%;
		margin-top: -8px;
	}
</style>
<script>
$( "#dialog" ).dialog({
	autoOpen: false,
	width: 500
});

function showDlg(id){
	$( "#dialog" ).dialog( "open" );
	$('#dialog').load(path+'?mod=context&menu=test&action=addItem&id='+id);
	
}
// Hover states on the static widgets
$( "#dialog-link, #icons li" ).hover(
	function() {
		$( this ).addClass( "ui-state-hover" );
	},
	function() {
		$( this ).removeClass( "ui-state-hover" );
	}
);
function shopItemsSid(id){
	$('#sidsRazdel').html('Loading...');
	$('#sidsRazdel').load('?mod=context&menu=test&action=sidsRazdel&id='+id);
}
function addToShop(){
	var sid = $("#sid").val();
	var it_type = $("#it_type1").val();
	var itm_id = $("#itm_id").text();
	
	$.ajax({
		url: "?mod=context&menu=test&action=addToShop",
		type: "POST",
		data: "it_type="+it_type+"&sid="+sid+"&itm_id="+itm_id,
		success: function(data){
			$("#workMsg").html(data);
			$("#item_"+itm_id).hide();
			loadShopLog();
		}
	});
}
</script>
<style>
.ui-button
{
margin:4px;
padding: 0;
background:none;
border: #dedfde 1px solid;
}
</style>
<div id="shopThings" style="min-width:240px;"></div>
</div>
<div id="shopLog" style="margin-left:20px;">Загрузка...</div>
</div>
<div id="dialog" title="Добавление в магазин"></div>