-- phpMyAdmin SQL Dump
-- version 4.7.9
-- https://www.phpmyadmin.net/
--
-- Хост: 10.0.2.7
-- Время создания: Ноя 27 2018 г., 20:03
-- Версия сервера: 5.7.22-22-log
-- Версия PHP: 5.6.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `a142598_fss`
--

-- --------------------------------------------------------

--
-- Структура таблицы `AllSKU`
--

CREATE TABLE `AllSKU` (
  `ApotekID` int(5) NOT NULL,
  `ShopSKU` int(6) NOT NULL,
  `ShtrichKod` int(13) NOT NULL,
  `NameSKU` varchar(255) NOT NULL,
  `MinTrudid1` int(3) NOT NULL,
  `MinTrudid2` int(2) NOT NULL,
  `MinTrudShop` int(6) NOT NULL,
  `ShopPrice` int(9) NOT NULL,
  `MinTrudFSS` int(6) NOT NULL,
  `FSSPrice` int(9) NOT NULL,
  `FSSAproval` int(1) DEFAULT NULL,
  `FSSAprovalTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `Apotekas`
--

CREATE TABLE `Apotekas` (
  `ApotekID` int(4) NOT NULL,
  `ApotekName` varchar(70) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `Apotekas`
--

INSERT INTO `Apotekas` (`ApotekID`, `ApotekName`) VALUES
(0, 'test'),
(1, 'test'),
(45, 'Аптека в Балашихе');

--
-- Триггеры `Apotekas`
--
DELIMITER $$
CREATE TRIGGER `after_apotekas_insert` AFTER INSERT ON `Apotekas` FOR EACH ROW INSERT INTO EFTS (ApotekID)
  VALUES (NEW.ApotekID)
$$
DELIMITER ;

-- --------------------------------------------------------

--
-- Структура таблицы `Applyes`
--

CREATE TABLE `Applyes` (
  `AppyID` int(5) NOT NULL,
  `ApotekID` int(5) NOT NULL,
  `EFTID` int(5) NOT NULL,
  `Snils` int(11) NOT NULL,
  `FSSSumm` decimal(9,0) NOT NULL DEFAULT '0',
  `ShopSumm` decimal(11,0) DEFAULT '0',
  `TransactionID` int(11) NOT NULL,
  `DateOfCreate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `DateOfTransaction` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00',
  `ShiftID` int(8) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `ApplySKUs`
--

CREATE TABLE `ApplySKUs` (
  `ApplyID` int(5) NOT NULL,
  `ShopSKU` int(6) NOT NULL,
  `MinTrudID` int(5) NOT NULL,
  `Qtity` int(4) NOT NULL,
  `SKUShopPrice` int(9) NOT NULL,
  `SKUShopSumm` int(9) NOT NULL,
  `SKUFSSPrice` int(9) NOT NULL,
  `SKUFSSSumm` int(9) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `EFTS`
--

CREATE TABLE `EFTS` (
  `EFTID` int(5) NOT NULL,
  `ApotekID` int(5) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `EFTS`
--

INSERT INTO `EFTS` (`EFTID`, `ApotekID`) VALUES
(0, 0),
(0, 1),
(0, 45);

-- --------------------------------------------------------

--
-- Структура таблицы `Invalides`
--

CREATE TABLE `Invalides` (
  `Snils` int(11) NOT NULL,
  `Family` char(40) NOT NULL,
  `Name` int(40) NOT NULL,
  `Otchestvo` int(40) NOT NULL,
  `DateOfBoth` date NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `MinTrdTable1`
--

CREATE TABLE `MinTrdTable1` (
  `MinTrudId1` int(4) NOT NULL,
  `MInTrud1Opis` varchar(70) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `MinTrdTable1`
--

INSERT INTO `MinTrdTable1` (`MinTrudId1`, `MInTrud1Opis`) VALUES
(6, 'Трости опорные и тактильные, костыли, опоры, поручни'),
(7, 'Кресла-коляски с ручным приводом (комнатные, прогулочные, активного ти'),
(8, 'Протезы и ортезы'),
(9, 'Ортопедическая обувь'),
(10, 'Противопролежневые матрацы и подушки'),
(11, 'Приспособления для одевания, раздевания и захвата предметов'),
(12, 'Специальная одежда'),
(13, 'Специальные устройства для чтения говорящих книг, для оптической корре'),
(14, 'Собаки-проводники с комплектом снаряжения'),
(15, 'Медицинские термометры и тонометры с речевым выходом'),
(16, 'Сигнализаторы звука световые и вибрационные'),
(17, 'Слуховые аппараты, в том числе с ушными вкладышами индивидуального изг'),
(18, 'Телевизоры с телетекстом для приема программ со скрытыми субтитрами'),
(19, 'Телефонные устройства с текстовым выходом'),
(20, 'Голосообразующие аппараты'),
(21, 'Специальные средства при нарушениях функций выделения(моче - и калопри'),
(22, 'Абсорбирующее белье, подгузники'),
(23, 'Кресла-стулья с санитарным оснащением'),
(231, 'Брайлевский дисплей, программное обеспечение экранного доступа');

-- --------------------------------------------------------

--
-- Структура таблицы `MinTrdTable2`
--

CREATE TABLE `MinTrdTable2` (
  `MinTrudid12` int(7) NOT NULL,
  `MinTrudid2` int(3) NOT NULL,
  `MinTrudOpis2` varchar(92) NOT NULL,
  `MinTrudid1` int(6) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `MinTrdTable2`
--

INSERT INTO `MinTrdTable2` (`MinTrudid12`, `MinTrudid2`, `MinTrudOpis2`, `MinTrudid1`) VALUES
(601, 1, 'Трость опорная', 6),
(602, 2, 'Трость тактильная', 6),
(603, 3, 'Трость белая опорная', 6),
(604, 4, 'Костыли', 6),
(605, 5, 'Опора в кровать', 6),
(606, 6, 'Опора для ползания для детей-инвалидов', 6),
(607, 7, 'Опора для сидения для детей-инвалидов', 6),
(608, 8, 'Опора для лежания для детей-инвалидов', 6),
(609, 9, 'Опора для стояния для детей-инвалидов', 6),
(610, 10, 'Ходунки', 6),
(611, 11, 'Поручни (перила) для самоподнимания', 6),
(701, 1, 'Кресло-коляска с ручным приводом комнатная (для инвалидов и детей-инвалидов)', 7),
(702, 2, 'Кресло-коляска с ручным приводом прогулочная (для инвалидов и детей-инвалидов)', 7),
(703, 3, 'Кресло-коляска активного типа (для инвалидов и детей-инвалидов)', 7),
(704, 4, 'Кресло-коляска с электроприводом (для инвалидов и детей-инвалидов)', 7),
(705, 5, 'Кресло-коляска малогабаритная (для инвалидов и детей-инвалидов)', 7),
(801, 1, 'Протезы косметические', 8),
(802, 2, 'Протезы рабочие', 8),
(803, 3, 'Протезы активные', 8),
(804, 4, 'Протезы с внешним источником энергии', 8),
(805, 5, 'Протезы после вычленения плеча', 8),
(806, 6, 'Чехлы на культи верхних конечностей', 8),
(807, 7, 'Протезы нижних конечностей', 8),
(808, 8, 'Чехлы на культю голени, бедра', 8),
(809, 9, 'Прочие протезы / ортезы', 8),
(901, 1, 'Ортопедическая обувь без утепленной подкладки', 9),
(902, 2, 'Ортопедическая обувь на утепленной подкладке', 9),
(1001, 1, 'Противопролежневые матрацы', 10),
(1002, 2, 'Противопролежневые подушки', 10),
(1101, 1, 'Приспособления для одевания, раздевания и захвата предметов', 11),
(1201, 1, 'Специальная одежда', 12),
(1301, 1, 'Специальные устройства для чтения говорящих книг, для оптической коррекции слабовидения', 13),
(1401, 1, 'Собаки-проводники с комплектом снаряжения', 14),
(1501, 1, 'Медицинские термометры и тонометры с речевым выходом', 15),
(1601, 1, 'Сигнализаторы звука световые и вибрационные', 16),
(1701, 1, 'Слуховые аппараты, в том числе с ушными вкладышами индивидуального изготовления', 17),
(1801, 1, 'Телевизоры с телетекстом для приема программ со скрытыми субтитрами', 18),
(1901, 1, 'Телефонные устройства с текстовым выходом', 19),
(2001, 1, 'Голосообразующие аппараты', 20),
(2101, 1, 'Специальные средства при нарушениях функций выделения (моче - и калоприемники)', 21),
(2201, 1, 'Абсорбирующее белье, подгузники', 22),
(2301, 1, 'Кресла-стулья с санитарным оснащением', 23),
(23101, 1, 'Брайлевский дисплей, программное обеспечение экранного доступа для инвалидов, в том числе де', 231);

-- --------------------------------------------------------

--
-- Структура таблицы `MinTrudTable`
--

CREATE TABLE `MinTrudTable` (
  `MinTrudid` int(7) NOT NULL,
  `TSRName` varchar(70) NOT NULL,
  `TSRNameForComp` varchar(50) NOT NULL,
  `MinTrudid1` int(6) NOT NULL,
  `MinTrudid12` int(6) NOT NULL,
  `MinTrudid3` int(6) NOT NULL,
  `FssPrice` int(9) NOT NULL DEFAULT '0'
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `MinTrudTable`
--

INSERT INTO `MinTrudTable` (`MinTrudid`, `TSRName`, `TSRNameForComp`, `MinTrudid1`, `MinTrudid12`, `MinTrudid3`, `FssPrice`) VALUES
(101, 'Трость опорная, регулируемая по высоте, без устройства противоскольжен', 'Трость опорная', 6, 601, 1, 0),
(60102, 'Трость опорная, регулируемая по высоте, с устройством противоскольжени', 'Трость опорная', 6, 601, 2, 0),
(60103, 'Трость опорная, не регулируемая по высоте, без устройства противосколь', 'Трость опорная', 6, 601, 3, 0),
(60104, 'Трость опорная, не регулируемая по высоте, с устройством противоскольж', 'Трость опорная', 6, 601, 4, 0),
(60105, 'Трость опорная с анатомической ручкой, регулируемая по высоте, без уст', 'Трость опорная', 6, 601, 5, 0),
(60106, 'Трость опорная с анатомической ручкой, регулируемая по высоте, с устро', 'Трость опорная', 6, 601, 6, 0),
(60107, 'Трость опорная с анатомической ручкой, не регулируемая по высоте, без ', 'Трость опорная', 6, 601, 7, 0),
(60108, 'Трость опорная с анатомической ручкой, не регулируемая по высоте, с ус', 'Трость опорная', 6, 601, 8, 0),
(60109, 'Трость 3-х опорная, регулируемая по высоте, без устройства противоскол', 'Трость опорная', 6, 601, 9, 0),
(60110, 'Трость 3-х опорная, регулируемая по высоте, с устройством противосколь', 'Трость опорная', 6, 601, 10, 0),
(60111, 'Трость 3-х опорная, не регулируемая по высоте, без устройства противос', 'Трость опорная', 6, 601, 11, 0),
(60112, 'Трость 3-х опорная, не регулируемая по высоте, с устройством противоск', 'Трость опорная', 6, 601, 12, 0),
(60113, 'Трость 3-х опорная с анатомической ручкой, регулируемая по высоте, без', 'Трость опорная', 6, 601, 13, 0),
(60114, 'Трость 3-х опорная с анатомической ручкой, регулируемая по высоте, с у', 'Трость опорная', 6, 601, 14, 0),
(60115, 'Трость 3-х опорная с анатомической ручкой, не регулируемая по высоте, ', 'Трость опорная', 6, 601, 15, 0),
(60116, 'Трость 3-х опорная с анатомической ручкой, не регулируемая по высоте, ', 'Трость опорная', 6, 601, 16, 0),
(60117, 'Трость 4-х опорная, регулируемая по высоте, без устройства противоскол', 'Трость опорная', 6, 601, 17, 0),
(60118, 'Трость 4-х опорная, регулируемая по высоте, с устройством противосколь', 'Трость опорная', 6, 601, 18, 0),
(60119, 'Трость 4-х опорная, не регулируемая по высоте, без устройства противос', 'Трость опорная', 6, 601, 19, 0),
(60120, 'Трость 4-х опорная, не регулируемая по высоте, с устройством противоск', 'Трость опорная', 6, 601, 20, 0),
(60121, 'Трость 4-х опорная с анатомической ручкой, регулируемая по высоте, без', 'Трость опорная', 6, 601, 21, 0),
(60122, 'Трость 4-х опорная с анатомической ручкой, регулируемая по высоте, с у', 'Трость опорная', 6, 601, 22, 0),
(60123, 'Трость 4-х опорная с анатомической ручкой, не регулируемая по высоте, ', 'Трость опорная', 6, 601, 23, 0),
(60124, 'Трость 4-х опорная с анатомической ручкой, не регулируемая по высоте, ', 'Трость опорная', 6, 601, 24, 0),
(60201, 'Трость белая тактильная цельная', 'Трость тактильная', 6, 602, 1, 0),
(60202, 'Трость белая тактильная складная', 'Трость тактильная', 6, 602, 2, 0),
(60301, 'Трость белая опорная, не регулируемая по высоте, с устройством противо', 'Трость опорная', 6, 603, 1, 0),
(60302, 'Трость белая опорная, не регулируемая по высоте, без устройства против', 'Трость опорная', 6, 603, 2, 0),
(60303, 'Трость белая опорная, регулируемая по высоте, с устройством противоско', 'Трость опорная', 6, 603, 3, 0),
(60304, 'Трость белая опорная, регулируемая по высоте, без устройства противоск', 'Трость опорная', 6, 603, 4, 0),
(60401, 'Костыли с опорой под локоть с устройством противоскольжения', 'Костыли', 6, 604, 1, 0),
(60402, 'Костыли с опорой под локоть без устройства противоскольжения', 'Костыли', 6, 604, 2, 0),
(60403, 'Костыли с опорой на предплечье с устройством противоскольжения', 'Костыли', 6, 604, 3, 0),
(60404, 'Костыли с опорой на предплечье без устройства противоскольжения', 'Костыли', 6, 604, 4, 0),
(60405, 'Костыли подмышечные с устройством противоскольжения', 'Костыли', 6, 604, 5, 0),
(60406, 'Костыли подмышечные без устройства противоскольжения', 'Костыли', 6, 604, 6, 0),
(60501, 'Опора в кровать веревочная', 'Опора в кровать', 6, 605, 1, 0),
(60502, 'Опора в кровать металлическая', 'Опора в кровать', 6, 605, 2, 0),
(60601, 'Опора для ползания для детей-инвалидов', 'Опора для детей-инвалидов', 6, 606, 1, 0),
(60701, 'Опора для сидения для детей-инвалидов', 'Опора для детей-инвалидов', 6, 607, 1, 0),
(60801, 'Опора для лежания для детей-инвалидов', 'Опора для детей-инвалидов', 6, 608, 1, 0),
(60901, 'Опора для стояния для детей-инвалидов', 'Опора для детей-инвалидов', 6, 609, 1, 0),
(61001, 'Ходунки шагающие', 'Ходунки', 6, 610, 1, 0),
(61002, 'Ходунки на колесах', 'Ходунки', 6, 610, 2, 0),
(61003, 'Ходунки с опорой на предплечье', 'Ходунки', 6, 610, 3, 0),
(61004, 'Ходунки с подмышечной опорой', 'Ходунки', 6, 610, 4, 0),
(61005, 'Ходунки-роллаторы', 'Ходунки', 6, 610, 5, 0),
(61006, 'Ходунки с дополнительной фиксацией (поддержкой) тела, в том числе для ', 'Ходунки', 6, 610, 6, 0),
(61007, 'Ходунки, изготавливаемые по индивидуальному заказу', 'Ходунки', 6, 610, 7, 0),
(61101, 'Поручни (перила) для самоподнимания угловые', 'Поручни (перила) для самоподнимания', 6, 611, 1, 0),
(61102, 'Поручни (перила) для самоподнимания прямые (линейные)', 'Поручни (перила) для самоподнимания', 6, 611, 2, 0),
(70101, 'Кресло-коляска с ручным приводом комнатная (для инвалидов и детей-инва', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 1, 0),
(70102, 'Кресло-коляска с ручным приводом с дополнительной фиксацией (поддержко', 'Кресло-коляска для больных ДЦП (для инвалидов и де', 7, 701, 2, 0),
(70103, 'Кресло-коляска с ручным приводом для управления одной рукой комнатная ', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 3, 0),
(70104, 'Кресло-коляска с ручным приводом с жестким сидением и спинкой комнатна', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 4, 0),
(70105, 'Кресло-коляска с ручным приводом с откидной спинкой комнатная (для инв', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 5, 0),
(70106, 'Кресло-коляска с ручным приводом с регулировкой угла наклона подножки ', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 6, 0),
(70107, 'Кресло-коляска с ручным приводом для лиц с большим весом комнатная (дл', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 701, 7, 0),
(70201, 'Кресло-коляска с ручным приводом прогулочная (для инвалидов и детей-ин', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 1, 0),
(70202, 'Кресло-коляска с ручным приводом с дополнительной фиксацией (поддержко', 'Кресло-коляска для больных ДЦП (для инвалидов и де', 7, 702, 2, 0),
(70203, 'Кресло-коляска с двуручным рычажным приводом прогулочная (для инвалидо', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 3, 0),
(70204, 'Кресло-коляска с приводом для управления одной рукой прогулочная (для ', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 4, 0),
(70205, 'Кресло-коляска с ручным приводом с жестким сидением и спинкой прогулоч', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 5, 0),
(70206, 'Кресло-коляска с ручным приводом с откидной спинкой прогулочная (для и', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 6, 0),
(70207, 'Кресло-коляска с ручным приводом с регулировкой угла наклона подножки ', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 7, 0),
(70208, 'Кресло-коляска с ручным приводом для лиц с большим весом прогулочная (', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 702, 8, 0),
(70301, 'Кресло-коляска активного типа (для инвалидов и детей-инвалидов)', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 703, 1, 0),
(70401, 'Кресло-коляска с электроприводом (для инвалидов и детей-инвалидов)', 'Кресло-коляска с электроприводом (для инвалидов и ', 7, 704, 1, 0),
(70402, 'Кресло-коляска с дополнительной фиксацией (поддержкой) головы и тела, ', 'Кресло-коляска для больных ДЦП с электроприводом (', 7, 704, 2, 0),
(70501, 'Кресло-коляска малогабаритная (для инвалидов и детей-инвалидов)', 'Кресло-коляска (для инвалидов и детей-инвалидов)', 7, 705, 1, 0),
(80101, 'Протез пальца косметический', 'Протез пальца', 8, 801, 1, 0),
(80102, 'Протез кисти косметический, в том числе при вычленении и частичном выч', 'Протез кисти, в том числе при вычленении и частичн', 8, 801, 2, 0),
(80103, 'Протез предплечья косметический', 'Протез предплечья', 8, 801, 3, 0),
(80104, 'Протез плеча косметический', 'Протез плеча', 8, 801, 4, 0),
(80201, 'Протез кисти рабочий, в том числе при вычленении и частичном вычленени', 'Протез кисти, в том числе при вычленении и частичн', 8, 802, 1, 0),
(80202, 'Протез предплечья рабочий', 'Протез предплечья', 8, 802, 2, 0),
(80203, 'Протез плеча рабочий', 'Протез плеча', 8, 802, 3, 0),
(80301, 'Протез кисти активный (тяговый), в том числе при вычленении и частично', 'Протез кисти, в том числе при вычленении и частичн', 8, 803, 1, 0),
(80302, 'Протез предплечья активный (тяговый)', 'Протез предплечья', 8, 803, 2, 0),
(80303, 'Протез плеча активный (тяговый)', 'Протез плеча', 8, 803, 3, 0),
(80401, 'Протез кисти с внешним источником энергии, в том числе при вычленении ', 'Протез кисти, в том числе при вычленении и частичн', 8, 804, 1, 0),
(80402, 'Протез предплечья с внешним источником энергии', 'Протез предплечья', 8, 804, 2, 0),
(80403, 'Протез плеча с внешним источником энергии', 'Протез плеча', 8, 804, 3, 0),
(80504, 'Протез после вычленения плеча с электромеханическим приводом и контакт', 'Протез после вычленения плеча', 8, 805, 4, 0),
(80505, 'Протез после вычленения плеча функционально-косметический', 'Протез после вычленения плеча', 8, 805, 5, 0),
(80601, 'Чехол на культю предплечья хлопчатобумажный', 'Чехол на культю предплечья', 8, 806, 1, 0),
(80602, 'Чехол на культю плеча хлопчатобумажный', 'Чехол на культю плеча', 8, 806, 2, 0),
(80603, 'Чехол на культю верхней конечности из полимерного материала (силиконов', 'Чехол на культю верхней конечности', 8, 806, 3, 0),
(80604, 'Косметическая оболочка на протез верхней конечности', 'Косметическая оболочка на протез верхней конечност', 8, 806, 4, 0),
(80701, 'Протез стопы', 'Протез стопы', 8, 807, 1, 0),
(80702, 'Протез голени лечебно-тренировочный', 'Протез голени лечебно-тренировочный', 8, 807, 2, 0),
(80703, 'Протез бедра лечебно-тренировочный', 'Протез бедра лечебно-тренировочный', 8, 807, 3, 0),
(80704, 'Протез голени для купания', 'Протез голени для купания', 8, 807, 4, 0),
(80705, 'Протез бедра для купания', 'Протез бедра для купания', 8, 807, 5, 0),
(80706, 'Протез голени немодульный, в том числе при врожденном недоразвитии', 'Протез голени', 8, 807, 6, 0),
(80707, 'Протез бедра немодульный, в том числе при врожденном недоразвитии', 'Протез бедра', 8, 807, 7, 0),
(80708, 'Протез при вычленении бедра немодульный', 'Протез при вычленении бедра', 8, 807, 8, 0),
(80709, 'Протез голени модульный, в том числе при недоразвитии', 'Протез голени', 8, 807, 9, 0),
(80710, 'Протез бедра модульный, в том числе при врожденном недоразвитии', 'Протез бедра', 8, 807, 10, 0),
(80711, 'Протез при вычленении бедра модульный', 'Протез при вычленении бедра', 8, 807, 11, 0),
(80712, 'Протез бедра модульный с внешним источником энергии', 'Протез бедра', 8, 807, 12, 0),
(80801, 'Чехол на культю голени хлопчатобумажный', 'Чехол на культю голени', 8, 808, 1, 0),
(80802, 'Чехол на культю бедра хлопчатобумажный', 'Чехол на культю бедра', 8, 808, 2, 0),
(80803, 'Чехол на культю голени шерстяной', 'Чехол на культю голени', 8, 808, 3, 0),
(80804, 'Чехол на культю бедра шерстяной', 'Чехол на культю бедра', 8, 808, 4, 0),
(80805, 'Чехол на культю голени из полимерного материала (силиконовый)', 'Чехол на культю голени', 8, 808, 5, 0),
(80806, 'Чехол на культю бедра из полимерного материала (силиконовый)', 'Чехол на культю бедра', 8, 808, 6, 0),
(80807, 'Косметическая оболочка на протез нижней конечности', 'Косметическая оболочка на протез нижней конечности', 8, 808, 7, 0),
(80901, 'Экзопротез молочной железы', 'Экзопротез молочной железы', 8, 809, 1, 0),
(80902, 'Чехол для экзопротеза молочной железы трикотажный', 'Чехол для экзопротеза молочной железы', 8, 809, 2, 0),
(80903, 'Зубные протезы (кроме зубных протезов из драгоценных металлов и других', 'Зубные протезы (кроме зубных протезов из драгоценн', 8, 809, 3, 0),
(80904, 'Глазной протез стеклянный', 'Глазной протез', 8, 809, 4, 0),
(80905, 'Глазной протез пластмассовый', 'Глазной протез', 8, 809, 5, 0),
(80906, 'Протез ушной', 'Протез ушной', 8, 809, 6, 0),
(80907, 'Протез носовой', 'Протез носовой', 8, 809, 7, 0),
(80908, 'Протез неба', 'Протез неба', 8, 809, 8, 0),
(80909, 'Протез голосовой', 'Протез голосовой', 8, 809, 9, 0),
(80910, 'Протез лицевой комбинированный, в том числе совмещенные протезы (ушной', 'Протез лицевой комбинированный, в том числе совмещ', 8, 809, 10, 0),
(80911, 'Протез половых органов', 'Протез половых органов', 8, 809, 11, 0),
(80912, 'Бандаж ортопедический на верхнюю конечность для улучшения лимфовенозно', 'Бандаж ортопедический на верхнюю конечность; банда', 8, 809, 12, 0),
(80913, 'Бандаж ортопедический поддерживающий или фиксирующий из хлопчатобумажн', 'Бандаж ортопедический поддерживающий или фиксирующ', 8, 809, 13, 0),
(80914, 'Бандаж торакальный ортопедический после операции на сердце и при травм', 'Бандаж торакальный ортопедический после операции н', 8, 809, 14, 0),
(80915, 'Бандаж-суспензорий', 'Бандаж-суспензорий', 8, 809, 15, 0),
(80916, 'Бандаж грыжевой (паховый, скротальный) односторонний, двухсторонний', 'Бандаж грыжевой (паховый, скротальный) односторонн', 8, 809, 16, 0),
(80917, 'Головодержатель полужесткой фиксации', 'Головодержатель полужесткой фиксации', 8, 809, 17, 0),
(80918, 'Головодержатель жесткой фиксации', 'Головодержатель жесткой фиксации', 8, 809, 18, 0),
(80919, 'Бандаж на коленный сустав (наколенник)', 'Бандаж на коленный сустав (наколенник)', 8, 809, 19, 0),
(80920, 'Бандаж компрессионный на нижнюю конечность', 'Бандаж компрессионный на нижнюю конечность, чулки ', 8, 809, 20, 0),
(80921, 'Бюстгальтер (лиф-крепление) и/или грация (полуграция) для фиксации экз', 'Бюстгальтер (лиф-крепление) и/или грация (или полу', 8, 809, 21, 0),
(80922, 'Корсет мягкой фиксации', 'Корсет, в том числе различной локализации по отдел', 8, 809, 22, 0),
(80923, 'Корсет полужесткой фиксации', 'Корсет, в том числе различной локализации по отдел', 8, 809, 23, 0),
(80924, 'Корсет жесткой фиксации', 'Корсет, в том числе различной локализации по отдел', 8, 809, 24, 0),
(80925, 'Корсет функционально-корригирующий', 'Корсет функционально-корригирующий', 8, 809, 25, 0),
(80926, 'Реклинатор - корректор осанки', 'Реклинатор - корректор осанки', 8, 809, 26, 0),
(80927, 'Аппарат на кисть', 'Аппарат на кисть', 8, 809, 27, 0),
(80928, 'Аппарат на кисть и лучезапястный сустав', 'Аппарат на кисть и лучезапястный сустав', 8, 809, 28, 0),
(80929, 'Аппарат на лучезапястный сустав', 'Аппарат на лучезапястный сустав', 8, 809, 29, 0),
(80930, 'Аппарат на локтевой сустав', 'Аппарат на локтевой сустав', 8, 809, 30, 0),
(80931, 'Аппарат на кисть, лучезапястный и локтевой суставы', 'Аппарат на кисть, лучезапястный и локтевой суставы', 8, 809, 31, 0),
(80932, 'Аппарат на лучезапястный и локтевой суставы', 'Аппарат на лучезапястный и локтевой суставы', 8, 809, 32, 0),
(80933, 'Аппарат на локтевой и плечевой суставы', 'Аппарат на локтевой и плечевой суставы', 8, 809, 33, 0),
(80934, 'Аппарат на лучезапястный, локтевой и плечевой суставы', 'Аппарат на лучезапястный, локтевой и плечевой суст', 8, 809, 34, 0),
(80935, 'Аппарат на плечевой сустав', 'Аппарат на плечевой сустав', 8, 809, 35, 0),
(80936, 'Аппарат на всю руку', 'Аппарат на всю руку', 8, 809, 36, 0),
(80937, 'Аппарат на голеностопный сустав', 'Аппарат на голеностопный сустав', 8, 809, 37, 0),
(80938, 'Аппарат на голеностопный и коленный суставы', 'Аппарат на голеностопный и коленный суставы', 8, 809, 38, 0),
(80939, 'Аппарат на коленный сустав', 'Аппарат на коленный сустав', 8, 809, 39, 0),
(80940, 'Аппарат на тазобедренный сустав', 'Аппарат на тазобедренный сустав', 8, 809, 40, 0),
(80941, 'Аппарат на коленный и тазобедренный суставы', 'Аппарат на коленный и тазобедренный суставы', 8, 809, 41, 0),
(80943, 'Аппарат на всю ногу', 'Аппарат на всю ногу; аппарат на всю ногу с полукор', 8, 809, 43, 0),
(80943, 'Аппарат на нижние конечности и туловище (ортез)', 'Аппарат на нижние конечности с полукорсетом; аппар', 8, 809, 43, 0),
(80944, 'Тутор на лучезапястный сустав', 'Тутор на лучезапястный сустав', 8, 809, 44, 0),
(80945, 'Тутор на предплечье', 'Тутор на предплечье', 8, 809, 45, 0),
(80946, 'Тутор на локтевой сустав', 'Тутор на локтевой сустав', 8, 809, 46, 0),
(80947, 'Тутор на плечевой сустав', 'Тутор на плечевой сустав', 8, 809, 47, 0),
(80948, 'Тутор на всю руку', 'Тутор на всю руку; шины отводящие для верхних коне', 8, 809, 48, 0),
(80949, 'Тутор на голеностопный сустав', 'Тутор на голеностопный сустав; тутор-стоподержател', 8, 809, 49, 0),
(80950, 'Тутор косметический на голень', 'Тутор косметический на голень', 8, 809, 50, 0),
(80951, 'Тутор на коленный сустав', 'Тутор на коленный сустав', 8, 809, 51, 0),
(80952, 'Тутор на тазобедренный сустав', 'Тутор на тазобедренный сустав', 8, 809, 52, 0),
(80953, 'Тутор на коленный и тазобедренный суставы', 'Тутор на коленный и тазобедренный суставы', 8, 809, 53, 0),
(80954, 'Тутор на всю ногу', 'Тутор на всю ногу; тутор на всю ногу с полукорсето', 8, 809, 54, 0),
(80955, 'Бандаж на лучезапястный сустав', 'Бандаж на лучезапястный сустав', 8, 809, 55, 0),
(80956, 'Бандаж на запястье', 'Бандаж на запястье', 8, 809, 56, 0),
(80957, 'Бандаж на локтевой сустав', 'Бандаж на локтевой сустав', 8, 809, 57, 0),
(80958, 'Бандаж на плечевой сустав', 'Бандаж на плечевой сустав', 8, 809, 58, 0),
(80959, 'Бандаж на верхнюю конечность - \'косынка\'', 'Бандаж на верхнюю конечность - \'косынка\'', 8, 809, 59, 0),
(80960, 'Бандаж на шейный отдел позвоночника', 'Бандаж на шейный отдел позвоночника; головодержате', 8, 809, 60, 0),
(80961, 'Бандаж на тазобедренный сустав', 'Бандаж на тазобедренный сустав', 8, 809, 61, 0),
(80962, 'Бандаж на голеностопный сустав', 'Бандаж на голеностопный сустав', 8, 809, 62, 0),
(90101, 'Ортопедическая обувь сложная без утепленной подкладки (пара)', 'Ортопедическая обувь сложная', 9, 901, 1, 0),
(90102, 'Ортопедическая обувь сложная на сохраненную конечность и обувь на прот', 'Ортопедическая обувь сложная на сохраненную конечн', 9, 901, 2, 0),
(90103, 'Ортопедическая обувь на протезы при двусторонней ампутации нижних коне', 'Ортопедическая обувь на протезы при двусторонней а', 9, 901, 3, 0),
(90104, 'Ортопедическая обувь сложная на аппарат без утепленной подкладки (пара', 'Ортопедическая обувь сложная на аппарат', 9, 901, 4, 0),
(90105, 'Ортопедическая обувь сложная на аппарат и обувь на протез без утепленн', 'Ортопедическая обувь сложная на аппарат и обувь на', 9, 901, 5, 0),
(90106, 'Вкладной башмачок', 'Вкладной башмачок', 9, 901, 6, 0),
(90107, 'Ортопедическая обувь малосложная без утепленной подкладки', 'Ортопедическая обувь малосложная', 9, 901, 7, 0),
(90108, 'Вкладные корригирующие элементы для ортопедической обуви (в том числе ', 'Вкладные корригирующие элементы для ортопедической', 9, 901, 8, 0),
(90201, 'Ортопедическая обувь сложная на утепленной подкладке (пара)', 'Ортопедическая обувь сложная', 9, 902, 1, 0),
(90202, 'Ортопедическая обувь сложная на сохраненную конечность и обувь на прот', 'Ортопедическая обувь сложная на сохраненную конечн', 9, 902, 2, 0),
(90203, 'Ортопедическая обувь сложная на аппарат на утепленной подкладке (пара)', 'Ортопедическая обувь сложная на аппарат', 9, 902, 3, 0),
(90204, 'Ортопедическая обувь сложная на аппарат и обувь на протез на утепленно', 'Ортопедическая обувь сложная на аппарат и обувь на', 9, 902, 4, 0),
(90205, 'Ортопедическая обувь малосложная на утепленной подкладке', 'Обувь ортопедическая малосложная', 9, 902, 5, 0),
(100101, 'Противопролежневый матрац полиуретановый', 'Противопролежневый матрац', 10, 1001, 1, 0),
(100102, 'Противопролежневый матрац гелевый', 'Противопролежневый матрац', 10, 1001, 2, 0),
(100103, 'Противопролежневый матрац воздушный (с компрессором)', 'Противопролежневый матрац', 10, 1001, 3, 0),
(100201, 'Противопролежневая подушка полиуретановая', 'Противопролежневая подушка', 10, 1002, 1, 0),
(100202, 'Противопролежневая подушка гелевая', 'Противопролежневая подушка', 10, 1002, 2, 0),
(100203, 'Противопролежневая подушка воздушная', 'Противопролежневая подушка', 10, 1002, 3, 0),
(110101, 'Приспособление для надевания рубашек', 'Приспособление для надевания', 11, 1101, 1, 0),
(110102, 'Приспособление для надевания колгот', 'Приспособление для надевания', 11, 1101, 2, 0),
(110103, 'Приспособление для надевания носков', 'Приспособление для надевания', 11, 1101, 3, 0),
(110104, 'Приспособление (крючок) для застегивания пуговиц', 'Приспособление (крючок) для застегивания пуговиц', 11, 1101, 4, 0),
(110105, 'Захват активный', 'Захват активный', 11, 1101, 5, 0),
(110106, 'Захват для удержания посуды', 'Захват для удержания различных предметов', 11, 1101, 6, 0),
(110107, 'Захват для открывания крышек', 'Захват для открывания различных предметов', 11, 1101, 7, 0),
(110108, 'Захват для ключей', 'Захват для ключей', 11, 1101, 8, 0),
(110109, 'Крюк на длинной ручке (для открывания форточек, створок окна и иных пр', 'Крюк на длинной ручке (для открывания форточек, ст', 11, 1101, 9, 0),
(110110, 'Насадка для утолщения объема письменных принадлежностей (ручки, каранд', 'Насадка для утолщения объема письменных принадлежн', 11, 1101, 10, 0),
(120101, 'Комплект функционально-эстетической одежды для инвалидов с парной ампу', 'Комплект функционально-эстетической одежды для инв', 12, 1201, 1, 0),
(120102, 'Ортопедические брюки', 'Ортопедические брюки', 12, 1201, 2, 0),
(120103, 'Рукавицы утепленные кожаные на меху (для инвалидов, пользующихся малог', 'Рукавицы утепленные кожаные на меху (для инвалидов', 12, 1201, 3, 0),
(120104, 'Шерстяной чехол на культю бедра (для инвалидов, пользующихся малогабар', 'Шерстяной чехол на культю бедра (для инвалидов, по', 12, 1201, 4, 0),
(120105, 'Пара кожаных или трикотажных перчаток (на протез верхней конечности и ', 'Пара кожаных или трикотажных перчаток (на протез в', 12, 1201, 5, 0),
(120106, 'Пара кожаных перчаток (на протезы обеих верхних конечностей)', 'Пара кожаных перчаток (на протезы обеих верхних ко', 12, 1201, 6, 0),
(120107, 'Пара кожаных перчаток на деформированные верхние конечности', 'Пара кожаных перчаток на деформированные верхние к', 12, 1201, 7, 0),
(120108, 'Кожаная перчатка на утепленной подкладке на кисть сохранившейся верхне', 'Кожаная перчатка на утепленной подкладке на кисть ', 12, 1201, 8, 0),
(130101, 'Специальное устройство для чтения \'говорящих книг\' на флэш-картах', 'Специальное устройство для чтения \'говорящих книг\'', 13, 1301, 1, 0),
(130102, 'Электронный ручной видеоувеличитель', 'Электронный ручной видеоувеличитель', 13, 1301, 2, 0),
(130103, 'Электронный стационарный видеоувеличитель', 'Электронный стационарный видеоувеличитель', 13, 1301, 3, 0),
(130104, 'Лупа ручная, опорная, лупа с подсветкой с увеличением до 10 крат', 'Лупа; очки для коррекции зрения', 13, 1301, 4, 0),
(140101, 'Собака-проводник с комплектом снаряжения', 'Собака-проводник с комплектом снаряжения', 14, 1401, 1, 0),
(150101, 'Медицинский термометр с речевым выходом', 'Медицинский термометр с речевым выходом', 15, 1501, 1, 0),
(150102, 'Медицинский тонометр с речевым выходом', 'Медицинский тонометр с речевым выходом', 15, 1501, 2, 0),
(160101, 'Сигнализатор звука цифровой со световой индикацией', 'Сигнализатор звука цифровой со световой индикацией', 16, 1601, 1, 0),
(160102, 'Сигнализатор звука цифровой с вибрационной индикацией', 'Сигнализатор звука цифровой с вибрационной индикац', 16, 1601, 2, 0),
(160103, 'Сигнализатор звука цифровой с вибрационной и световой индикацией', 'Сигнализатор звука цифровой с вибрационной и свето', 16, 1601, 3, 0),
(170101, 'Слуховой аппарат аналоговый заушный сверхмощный', 'Слуховой аппарат', 17, 1701, 1, 0),
(170102, 'Слуховой аппарат аналоговый заушный мощный', 'Слуховой аппарат', 17, 1701, 2, 0),
(170103, 'Слуховой аппарат аналоговый заушный средней мощности', 'Слуховой аппарат', 17, 1701, 3, 0),
(170104, 'Слуховой аппарат аналоговый заушный слабой мощности', 'Слуховой аппарат', 17, 1701, 4, 0),
(170105, 'Слуховой аппарат цифровой заушный сверхмощный', 'Слуховой аппарат', 17, 1701, 5, 0),
(170106, 'Слуховой аппарат цифровой заушный мощный', 'Слуховой аппарат', 17, 1701, 6, 0),
(170107, 'Слуховой аппарат цифровой заушный средней мощности', 'Слуховой аппарат', 17, 1701, 7, 0),
(170108, 'Слуховой аппарат цифровой заушный слабой мощности', 'Слуховой аппарат', 17, 1701, 8, 0),
(170109, 'Слуховой аппарат карманный супермощный', 'Слуховой аппарат', 17, 1701, 9, 0),
(170110, 'Слуховой аппарат карманный мощный', 'Слуховой аппарат', 17, 1701, 10, 0),
(170111, 'Слуховой аппарат цифровой заушный для открытого протезирования', 'Слуховой аппарат для открытого протезирования', 17, 1701, 11, 0),
(170112, 'Слуховой аппарат цифровой внутриушной мощный', 'Слуховой аппарат', 17, 1701, 12, 0),
(170113, 'Слуховой аппарат цифровой внутриушной средней мощности', 'Слуховой аппарат', 17, 1701, 13, 0),
(170114, 'Слуховой аппарат цифровой внутриушной слабой мощности', 'Слуховой аппарат', 17, 1701, 14, 0),
(170115, 'Слуховой аппарат костной проводимости (неимплантируемый)', 'Слуховой аппарат костной проводимости (неимплантир', 17, 1701, 15, 0),
(170116, 'Вкладыш ушной индивидуального изготовления (для слухового аппарата)', 'Вкладыш ушной индивидуального изготовления (для сл', 17, 1701, 16, 0),
(180101, 'Телевизор с телетекстом для приема программ со скрытыми субтитрами с д', 'Телевизор', 18, 1801, 1, 0),
(190101, 'Телефонное устройство с текстовым выходом', 'Телефонное устройство с текстовым выходом, в том ч', 19, 1901, 1, 0),
(200101, 'Голосообразующий аппарат', 'Голосообразующий аппарат', 20, 2001, 1, 0),
(210101, 'Однокомпонентный дренируемый калоприемник со встроенной плоской пласти', 'Калоприемник', 21, 2101, 1, 0),
(210102, 'Однокомпонентный дренируемый калоприемник со встроенной конвексной пла', 'Калоприемник', 21, 2101, 2, 0),
(210103, 'Однокомпонентный недренируемый калоприемник со встроенной плоской плас', 'Калоприемник', 21, 2101, 3, 0),
(210104, 'Однокомпонентный недренируемый калоприемник со встроенной конвексной п', 'Калоприемник', 21, 2101, 4, 0),
(210105, 'Однокомпонентный дренируемый уроприемник со встроенной плоской пластин', 'Уроприемник', 21, 2101, 5, 0),
(210106, 'Однокомпонентный дренируемый уроприемник со встроенной конвексной плас', 'Уроприемник', 21, 2101, 6, 0),
(210107, 'Двухкомпонентный дренируемый калоприемник в комплекте: адгезивная плас', 'Калоприемник в комплекте', 21, 2101, 7, 0),
(210108, 'Двухкомпонентный дренируемый калоприемник для втянутых стом в комплект', 'Калоприемник для втянутых стом в комплекте', 21, 2101, 8, 0),
(210109, 'Двухкомпонентный недренируемый калоприемник в комплекте: адгезивная пл', 'Калоприемник в комплекте', 21, 2101, 9, 0),
(210110, 'Двухкомпонентный недренируемый калоприемник для втянутых стом в компле', 'Калоприемник для втянутых стом в комплекте', 21, 2101, 10, 0),
(210111, 'Двухкомпонентный дренируемый уроприемник в комплекте: адгезивная пласт', 'Уроприемник в комплекте', 21, 2101, 11, 0),
(210112, 'Двухкомпонентный дренируемый уроприемник для втянутых стом в комплекте', 'Уроприемник для втянутых стом в комплекте', 21, 2101, 12, 0),
(210113, 'Пояс для калоприемников и уроприемников', 'Пояс для калоприемников и уроприемников', 21, 2101, 13, 0),
(210114, 'Калоприемник из пластмассы на поясе в комплекте с мешками', 'Калоприемник', 21, 2101, 14, 0),
(210115, 'Мочеприемник ножной (мешок для сбора мочи) дневной', 'Мочеприемник', 21, 2101, 15, 0),
(210116, 'Мочеприемник прикроватный (мешок для сбора мочи) ночной', 'Мочеприемник', 21, 2101, 16, 0),
(210117, 'Пара ремешков для крепления мочеприемников (мешков для сбора мочи) к н', 'Пара ремешков для крепления мочеприемников (мешков', 21, 2101, 17, 0),
(210118, 'Уропрезерватив с пластырем', 'Уропрезерватив', 21, 2101, 18, 0),
(210119, 'Уропрезерватив самоклеящийся', 'Уропрезерватив', 21, 2101, 19, 0),
(210120, 'Катетер для самокатетеризации лубрицированный', 'Катетер', 21, 2101, 20, 0),
(210121, 'Наборы - мочеприемники для самокатетеризации: мешок - мочеприемник, ка', 'Наборы-мочеприемники для самокатетеризации', 21, 2101, 21, 0),
(210122, 'Катетер уретральный длительного пользования', 'Катетер уретральный длительного пользования', 21, 2101, 22, 0),
(210123, 'Катетер уретральный постоянного пользования', 'Катетер уретральный постоянного пользования', 21, 2101, 23, 0),
(210124, 'Катетер для эпицистостомы', 'Катетер для эпицистостомы', 21, 2101, 24, 0),
(210125, 'Система (с катетером) для нефростомии', 'Система (с катетером) для нефростомии', 21, 2101, 25, 0),
(210126, 'Катетер мочеточниковый для уретерокутанеостомы', 'Катетер мочеточниковый для уретерокутанеостомы', 21, 2101, 26, 0),
(210127, 'Анальный тампон (средство ухода при недержании кала)', 'Анальный тампон (средство ухода при недержании кал', 21, 2101, 27, 0),
(210128, 'Ирригационная система для опорожнения кишечника через колостому', 'Ирригационная система для опорожнения кишечника че', 21, 2101, 28, 0),
(210129, 'Паста-герметик для защиты и выравнивания кожи вокруг стомы в тубе, не ', 'Паста-герметик для защиты и выравнивания кожи вокр', 21, 2101, 29, 0),
(210130, 'Паста-герметик для защиты и выравнивания кожи вокруг стомы в полосках,', 'Паста-герметик для защиты и выравнивания кожи вокр', 21, 2101, 30, 0),
(210131, 'Крем защитный в тубе, не менее 60 мл', 'Крем защитный', 21, 2101, 31, 0),
(210132, 'Пудра (порошок) абсорбирующая в тубе, не менее 25 г', 'Пудра (порошок) абсорбирующая', 21, 2101, 32, 0),
(210133, 'Защитная пленка во флаконе, не менее 50 мл', 'Защитная пленка', 21, 2101, 33, 0),
(210134, 'Защитная пленка в форме салфеток, не менее 30 шт.', 'Защитная пленка', 21, 2101, 34, 0),
(210135, 'Очиститель для кожи во флаконе, не менее 180 мл', 'Очиститель для кожи', 21, 2101, 35, 0),
(210136, 'Очиститель для кожи в форме салфеток, не менее 30 шт.', 'Очиститель для кожи', 21, 2101, 36, 0),
(210137, 'Нейтрализатор запаха во флаконе, не менее 50 мл', 'Нейтрализатор запаха', 21, 2101, 37, 0),
(210138, 'Абсорбирующие желирующие пакетики для стомных мешков, 30 шт.', 'Абсорбирующие желирующие пакетики для стомных мешк', 21, 2101, 38, 0),
(210139, 'Адгезивная пластина-полукольцо для дополнительной фиксации пластин кал', 'Адгезивная пластина-полукольцо для дополнительной ', 21, 2101, 39, 0),
(210140, 'Адгезивная пластина - кожный барьер', 'Адгезивная пластина - кожный барьер', 21, 2101, 40, 0),
(210141, 'Защитные кольца для кожи вокруг стомы', 'Защитные кольца для кожи вокруг стомы', 21, 2101, 41, 0),
(210142, 'Тампон для стомы', 'Тампон для стомы', 21, 2101, 42, 0),
(220101, 'Впитывающие простыни (пеленки) размером не менее 40 х 60 см (впитываем', 'Впитывающие простыни; впитывающие пеленки', 22, 2201, 1, 0),
(220102, 'Впитывающие простыни (пеленки) размером не менее 60 х 60 см (впитываем', 'Впитывающие простыни; впитывающие пеленки', 22, 2201, 2, 0),
(220103, 'Впитывающие простыни (пеленки) размером не менее 60 х 90 см (впитываем', 'Впитывающие простыни; впитывающие пеленки', 22, 2201, 3, 0),
(220104, 'Подгузники для взрослых, размер \'XS\' (объем талии/бедер до 60 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 4, 0),
(220105, 'Подгузники для взрослых, размер \'XS\' (объем талии/бедер до 60 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 5, 0),
(220106, 'Подгузники для взрослых, размер \'S\' (объем талии/бедер до 90 см), с по', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 6, 0),
(220107, 'Подгузники для взрослых, размер \'S\' (объем талии/бедер до 90 см), с по', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 7, 0),
(220108, 'Подгузники для взрослых, размер \'М\' (объем талии/бедер до 120 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 8, 0),
(220109, 'Подгузники для взрослых, размер \'М\' (объем талии/бедер до 120 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 9, 0),
(220110, 'Подгузники для взрослых, размер \'L\' (объем талии/бедер до 150 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 10, 0),
(220111, 'Подгузники для взрослых, размер \'L\' (объем талии/бедер до 150 см), с п', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 11, 0),
(220112, 'Подгузники для взрослых, размер \'XL\' (объем талии/бедер до 175 см), с ', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 12, 0),
(220113, 'Подгузники для взрослых, размер \'XL\' (объем талии/бедер до 175 см), с ', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 13, 0),
(220114, 'Подгузники для детей весом до 5 кг', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 14, 0),
(220115, 'Подгузники для детей весом до 6 кг', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 15, 0),
(220116, 'Подгузники для детей весом до 9 кг', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 16, 0),
(220117, 'Подгузники для детей весом до 20 кг', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 17, 0),
(220118, 'Подгузники для детей весом свыше 20 кг', 'Подгузники для взрослых; подгузники для детей; уро', 22, 2201, 18, 0),
(230101, 'Кресло-стул с санитарным оснащением (с колесами)', 'Кресло-стул с санитарным оснащением', 23, 2301, 1, 0),
(230102, 'Кресло-стул с санитарным оснащением (без колес)', 'Кресло-стул с санитарным оснащением', 23, 2301, 2, 0),
(230103, 'Кресло-стул с санитарным оснащением пассивного типа повышенной грузопо', 'Кресло-стул с санитарным оснащением', 23, 2301, 3, 0),
(230104, 'Кресло-стул с санитарным оснащением с дополнительной фиксацией (поддер', 'Кресло-стул с санитарным оснащением', 23, 2301, 4, 0),
(230105, 'Кресло-стул с санитарным оснащением активного типа', 'Кресло-стул с санитарным оснащением', 23, 2301, 5, 0),
(2310101, 'Брайлевский дисплей для инвалидов, в том числе детей-инвалидов, с нару', 'Брайлевский дисплей', 231, 23101, 1, 0),
(2310102, 'Программное обеспечение экранного доступа для инвалидов, в том числе д', 'Программное обеспечение экранного доступа', 231, 23101, 2, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `Shifts`
--

CREATE TABLE `Shifts` (
  `ShiftID` int(8) NOT NULL,
  `TimeStampOpen` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `TimeStampClosed` timestamp NULL DEFAULT NULL,
  `Date` date DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

-- --------------------------------------------------------

--
-- Структура таблицы `SKUWork`
--

CREATE TABLE `SKUWork` (
  `ApotekID` int(5) NOT NULL,
  `ShopSKU` int(10) NOT NULL,
  `ShtrichKod` varchar(13) NOT NULL,
  `Name` char(60) NOT NULL,
  `MinTrudID` int(8) NOT NULL,
  `PriceShop` int(9) DEFAULT NULL,
  `FssPrice` int(9) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=cp1251;

--
-- Дамп данных таблицы `SKUWork`
--

INSERT INTO `SKUWork` (`ApotekID`, `ShopSKU`, `ShtrichKod`, `Name`, `MinTrudID`, `PriceShop`, `FssPrice`) VALUES
(1, 1, '8717627110211', 'Anti Angin', 1, 1000, 800),
(0, 2, '4603556005275', 'Salfetka iz kfc', 1, 10, 2),
(0, 1, '2722449000356', 'Tovar', 2, 5, 6);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `MinTrdTable1`
--
ALTER TABLE `MinTrdTable1`
  ADD PRIMARY KEY (`MinTrudId1`),
  ADD UNIQUE KEY `MinTrudid1Index` (`MinTrudId1`),
  ADD KEY `MinTrdTable2` (`MinTrudId1`);

--
-- Индексы таблицы `MinTrdTable2`
--
ALTER TABLE `MinTrdTable2`
  ADD KEY `MinTrudid1_const` (`MinTrudid1`);

--
-- Индексы таблицы `MinTrudTable`
--
ALTER TABLE `MinTrudTable`
  ADD KEY `MinTrudid1_const` (`MinTrudid1`);

--
-- Индексы таблицы `Shifts`
--
ALTER TABLE `Shifts`
  ADD PRIMARY KEY (`ShiftID`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `MinTrdTable1`
--
ALTER TABLE `MinTrdTable1`
  MODIFY `MinTrudId1` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=232;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
