<?php 
session_start();
$mysqli_connect = mysqli_connect('localhost', 'cparta', 'O0m6R9l1', 'cparta') or die("Не удалось подключиться");
$id = $_SESSION['id'];
$request_bd = mysqli_query($mysqli_connect, "SELECT * FROM `users` WHERE `id` = '$id'");
$user = $request_bd->fetch_assoc();

if(isset($_POST['btn_accepted'])){
    echo $_SERVER['DOCUMENT_ROOT'].'/utilities/src/DB.php';
    $src = $_POST['src'];
    $QQ = "UPDATE `users` SET `agreement` = '1' WHERE `id` = '$id' ";
    mysqli_query($mysqli_connect, $QQ);
    header("Location: {$src}");
    // echo '123';
    // var_dump($_SERVER);
}
?>
<!DOCTYPE html>
<html lang="ru">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</title>
</head>
<body>
    <style>
        body {
            background-color: grey;
        }
        div {
            margin: 0 23% 0 23%;
            padding: 20px;
            background-color: white;
        }

        input {
        text-decoration: none;
        outline: none;
        display: inline-block;
        width: 200px;
        height: 45px;
        line-height: 45px;
        border-radius: 45px;
        margin: 10px 20px;
        font-family: 'Montserrat', sans-serif;
        font-size: 11px;
        text-transform: uppercase;
        text-align: center;
        letter-spacing: 3px;
        font-weight: 600;
        color: #524f4e;
        background: white;
        box-shadow: 0 8px 15px rgba(0,0,0,.1);
        transition: .3s;
        }
        input:hover {
        background: #2EE59D;
        box-shadow: 0 15px 20px rgba(46,229,157,.4);
        color: white;
        transform: translateY(-7px);
        }
    </style>
    <div>
        <center><h2>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h2>
        (версия от 20.04.2020 г.)</center><br><br>

        <b><center>1. ВВОДНАЯ ЧАСТЬ.</center></b><br>
        Благодарим Вас за использование нашей информационной платформы «CPArta», а также связанных с ней сервисов, служб и функций, размещенных на сайте <a href="www.cparta.net">www.cparta.net</a> (далее совместно именуемых «Сервис», «Сайт» или «Партнерская сеть»).
        Администрация Сайта предоставляет Вам доступ к использованию Сайта на условиях, указанных в настоящем Пользовательском соглашении. Просим Вам внимательно ознакомиться с положениями настоящего Пользовательского соглашения, которое является публичной офертой (ст. 437 Гражданского кодекса РФ).
        Если Вы не согласны с положениями настоящего Пользовательского соглашения (полностью или частично) либо не понимаете изложенных в нем условий, просим Вас не использовать в дальнейшем функционал Сайта.
        Регистрация в качестве пользователя на Сайте с обязательным проставлением отметки о согласии с условиями Пользовательского соглашения, а также использование Сервиса и функциональных возможностей Сайта, означает, что пользователь ознакомился и согласен с настоящим Пользовательским соглашением, обязался соблюдать его условия в полном объеме (акцептовал публичную оферту).
        Администрация Сайта вправе в любое время в одностороннем порядке изменять условия настоящего Пользовательского соглашения. Такие изменения вступают в силу по истечении 3 (Трех) дней с момента размещения новой версии Пользовательского соглашения на Сайте. При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту, удалить весь размещенный им Контент, прекратить использование материалов и сервисов Сайта.
        <br><br>
        <b><center>2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ.</center></b><br>
        Администрация Сайта – владелец сайта <a href="www.cparta.net">www.cparta.net</a>, которым является ООО  ИА «Медиа Телеком Групп» (ОГРН 5187746032194, ИНН 9709040715, место нахождения: 101000, город Москва, Колпачный переулок, дом 6 строение 5, пом II ком 4 оф 11, электронная почта: mediateleckom@yandex.ru), осуществляющий услуги хостинга;
        Веб-мастер - лицо, оказывающее услуги по трансляции коммерческих предложений Рекламодателей, а также лицо, привлекающее пользователей на рекламные сайты Рекламодателей Сервиса.
        Рекламодатель – лицо, предоставляющее возможности для рекламы своих товаров и услуг посредством различных рекламных средств путем размещения на Сайте коммерческих предложений (офферов).
        Пользователь – Веб-мастер и/или Рекламодатель, зарегистрированные на Сайте в установленном настоящим Пользовательским соглашением порядке.
        Контент Сервиса - графические материалы, фотографии, видео, аудио, текст, элементы брендинга (в том числе фирменные наименования, товарные знаки, знаки обслуживания, логотипы и т.п.), офферы, лендинги, интерактивные функции, программное обеспечение и другие материалы, предоставленные Рекламодателями и/или Веб-мастерами.
        Оффер – предоставленное Рекламодателем отдельно взятое коммерческое предложение о приобретении неограниченным кругом лиц товаров и/или услуг.
        Фрод – неправомерные и/или недобросовестные действия Веб-мастера, направленные на умышленное создание ситуации фиктивного заказа клиентом товаров и/или услуг Рекламодателя без реального приобретения их в последующем, а также иные обманные действия по завышению результативности оплачиваемой деятельности веб-мастера.
        <br><br><b><center>3. ПОРЯДОК ИСПОЛЬЗОВАНИЯ СЕРВИСА.</center></b><br>
        <center><i>3.1. РЕГИСТРАЦИЯ НА САЙТЕ.</i></center><br>
        Для пользования функционалом Сервиса Веб-мастер и/или Рекламодатель проходят процедуру регистрации, которой является заполнение и отправка регистрационной формы с обязательным проставлением отметки о согласии с условиями настоящего Пользовательского соглашения, а также Политикой конфиденциальности, касающейся обработки персональных данных.
        При заполнении регистрационной формы заявителю необходимо заполнить все обязательные поля корректной и актуальной информацией.
        К регистрации в качестве Веб-мастера и/или Рекламодателя в Партнерской сети допускаются дееспособные физические лица, достигшие 18 лет, а также индивидуальные предприниматели и юридические лица.
        Если Вы пользуетесь Сервисом, в том числе проходите процедуру регистрации, от имени юридического лица или индивидуального предпринимателя, то подтверждаете, что у Вас имеются все необходимые полномочия действовать от имени этого юридического лица или индивидуального предпринимателя и что это юридическое лицо или индивидуальный предприниматель принимает условия Пользовательского соглашения и Политики конфиденциальности. Физическое лицо, прошедшее процедуру регистрации от имени юридического лица или индивидуального предпринимателя принимает на себя обязательство отвечать за исполнение последними всех своих обязательств в полном объеме (наравне с ними) в солидарном порядке.
        Администрация Сайта имеет право отказать в регистрации без объяснения причин.
        Все взаимодействие Пользователя и Администрации Сайта осуществляется посредством использования личного кабинета Пользователя, через который могут направляться любые заявки, запросы, сообщения, а также любая иная информация. Кроме того, Пользователи вправе осуществлять взаимодействие с Администрацией Сайта посредством электронной почты.

        <br><br><center><i>3.2. БЛОКИРОВАНИЕ АККАУНТА.</i></center><br>
        Администрация Сайта имеет право полностью заблокировать аккаунт Пользователя за нарушение любого из следующих правил без выплат каких-либо денежных средств:
        <li>создание более одного аккаунта на одного пользователя. В случае выявления дублирующих аккаунтов полностью блокируются все аккаунты. Администрация Сайта имеет право согласовать создание нескольких аккаунтов в случае необходимости при условии заблаговременного обращения с такой просьбой</li>
        <li>указание Пользователем недостоверных или неверных сведений при регистрации. В таком случае Пользователь имеет право сообщить о своем несогласии с блокировкой аккаунта в течение трех рабочих дней с даты блокировки с указанием причин несогласия (например, допущенной опечаткой или изменением сведений). Администрация Сайта вправе разблокировать аккаунт в случае уважительности причин предоставления недостоверных или неверных сведений</li>
        <li>нарушение прав на интеллектуальную собственность (авторские, патентные, смежные и иные права)</li>
        <li>совершение Веб-мастером действий (бездействия), подпадающих под понятие фрода</li>
        <li>нарушение Пользователем действующего законодательства РФ, включая, но не ограничиваясь, законодательством о рекламе, интеллектуальной собственности, антимонопольном регулировании и т.д.</li>
        <li>прочие нарушения по усмотрению Администрации Сайта.</li>
        Чтобы обеспечить защиту аккаунта, никому не сообщайте свой пароль и не используйте его повторно в сторонних приложениях. Любые действия совершенные с аккаунта будут считаться совершенными Пользователем-владельцем аккаунта.

        <br><br><i><center>3.3. ОБЩИЕ ПОЛОЖЕНИЯ.</center></i><br>
        Главное функциональное предназначение Сайта – организация места встречи Рекламодателя, Веб-мастера и/или посетителей Сайта в виртуальном пространстве сети Интернет. На Администрацию Сайта возлагаются соответствующие обязательства по поддержанию работоспособности Сайта.
        После регистрации Пользователям предоставляется возможность пользования Сервисом: Рекламодатели получают возможность разместить на Сайте подготовленные собственными силами и средствами офферы, а также оставить ссылки на сайты (в т.ч. лендинги), которые не принадлежат «CPArta» и не контролируются Администрацией Сайта, в целях рекламирования и продвижения товаров и/или услуг, а Веб-мастеры получают возможность выбрать любой оффер в качестве целевого и осуществлять любые, не запрещенные законом действия по трансляции коммерческих предложений в сети Интернет и привлечению пользователей на рекламные сайты Рекламодателей.
        Веб-мастер имеет право свободно и в полной мере пользоваться функционалом Сервиса и офферами, размещенными на Сайте, кроме тех случаев, когда такое использование является незаконным, нарушает права, свободы и интересы Администрации Сайта, Рекламодателей, других веб-мастеров Сайта и (или) любых третьих лиц.
        Администрация Сайта предоставляет во временное пользование Рекламодателям и/или Веб-мастерам информационное поле Сайта, обязуется осуществлять его техническую поддержку, обеспечивать его бесперебойную работу.
        За услуги по предоставлению площадки для размещения Пользователями Контента, а также поддержке работоспособности и функционирования Сервиса Администрации Сайта подлежит уплате вознаграждение в размерах и порядке, определяемых в индивидуальном порядке по соглашениям с Пользователями.
        В случаях необходимости проведения регламентных и иных технических работ Администрация Сайта имеет право приостанавливать функционирование Сервиса на период проведения таких работ.
        Пользователи Сервиса, предоставившие Контент и распространяющие его в сети Интернет, несут самостоятельную ответственность за его содержание. Администрация Сайта для такого Контента является поставщиком услуг хостинга (хостинг-провайдером).
        Администрация Сайта не вправе вносить изменения в размещенный Пользователями Контент, за исключением оформительских действий (изменения шрифта, размера и структуры текста) и иных действий, осуществляемых для обеспечения технологического процесса передачи материала;
        Любое лицо, зашедшее на Сайт, при обнаружении Контента, не соответствующего настоящему Пользовательскому соглашению, в т.ч. нарушающего закон, может сообщить Администрации Сайта об этом.
        Любые права, не предоставленные в явной форме настоящим Пользовательским соглашением, остаются за соответствующими правообладателями. Использование Сервиса не дает Пользователям интеллектуальные права на Контент, размещенному на Сайте.
        К размещению в Партнерской сети допускаются офферы, не нарушающие действующее законодательство РФ, а также прав третьих лиц, в частности, прав на результаты интеллектуальной деятельности.
        Рекламодателю необходимо прислать Администрации Сайта офферы, а также соответствующие офферу лендинги и транзитные страницы, при этом Администрация Сайта не обязана проверять их на соответствие действующему законодательству. После размещения оффера все дальнейшие изменения и дополнения в офферы вносит Рекламодатель.

        <br><br><i><center>3.4. ПРАВА И ОБЯЗАННОСТИ ПОЛЬЗОВАТЕЛЕЙ.</center></i><br>
        Пользователь обязуется не предпринимать действий, которые могут рассматриваться как нарушающие законодательство РФ или нормы международного права, в том числе в сфере интеллектуальной собственности, авторских и/или смежных правах, а также любых действий, которые приводят или могут привести к нарушению нормальной работы Сайта и его сервисов.
        Весь загруженный Пользователем Контент должен соответствовать Пользовательскому соглашению и действующему законодательству. Контент не должен содержать интеллектуальную собственность третьих лиц, если у Пользователя нет на то разрешения соответствующего лица или других законных оснований. Использование Контента Сайта без согласия правообладателей не допускается. Для правомерного использования материалов Сайта необходимо заключение лицензионных договоров (получение лицензий от правообладателей).
        Если у Администрации Сайта появятся основания полагать, что загруженный Пользователем Контент нарушает условия настоящего Пользовательского соглашения, например, при поступлении жалобы правообладателя, или может нанести вред платформе «CPArta», другим Пользователям либо третьим лицам, то Администрация Сайта может удалить Контент и заблокировать аккаунт Пользователя.
        В случае предъявления третьим лицом к Администрации Сайта каких-либо претензий, требований и исков, возникших в связи с размещением в Партнерской сети офферов, лендингов Рекламодателя или в связи с действиями Веб-мастеров, распространивших информацию, содержащуюся в офферах, в частности, претензий, требований, исков о нарушении прав таких третьих лиц на результаты интеллектуальной деятельности и средства индивидуализации, Администрация Сайта обязана в течение трех рабочих дней с момента получения соответствующего требования уведомить об этом Рекламодателя/Веб-мастера, а Рекламодатель/Веб-мастер обязан предпринять все меры для урегулирования претензий, требований, исков третьих лиц своими силами и за свой сче. При этом, в случае предъявления такими третьими лицами исков к Администрации Сайта в суд Рекламодатель/Веб-мастер по требованию Администрации Сайта обязан вступить в дело на стороне Администрации Сайта и доказывать правомерность использования информации, размещенной в офферах, лендингах и ином Контенте, в том числе, использования результатов интеллектуальной деятельности и средств индивидуализации.

        <br><br><i><center>3.5. ОСОБЕННОСТИ РАСЧЕТОВ С ВЕБ-МАСТЕРАМИ:</center></i><br>
        <li>Администрация Сайта может задержать выплаты, причитающиеся Веб-мастеру, на срок до четырнадцати календарных дней в случае подозрения на фрод (накрутку) для анализа ситуации</li>
        <li>в целях защиты Рекламодателей от фродовых действий со стороны Веб-мастеров, Администрация Сайта в случае выявления таких действий имеет право взыскать штраф с Веб-мастера, путем удержания от 10 от 100% денежных средств, находящихся на балансе аккаунта Пользователя, в зависимости от грубости, количества и длительности допущенных нарушений. Если выявлен факт фрода, то аккаунт может быть заблокирован полностью без возможности восстановления, а все денежные средства возвращены на счета Рекламодателей в полном объеме.</li>
        <li>минимальная сумма к выплате составляет 5 000 руб. 00 коп.</li>

        <br><br><i><center>3.6. ЗАПРЕТЫ И ОГРАНИЧЕНИЯ:</center></i><br>
        К участию в Партнерской сети не принимаются в качестве источников трафика веб-сайты и сервиcы, содержащие материалы, запрещенные действующим законодательством РФ, включая, не ограничиваясь, следующими:
        <li>потенциально либо объективно опасные для посетителей, в том числе вирусы в любом их проявлении</li>
        <li>пропагандирующие насилие в любой форме</li>
        <li>порнографического характера</li>
        <li>пропагандирующие дискриминацию по возрастной, расовой, половой, религиозной, национальной принадлежности</li>
        <li>нарушающие права интеллектуальной собственности любых третьих лиц.</li>

        <br><br>Администрация Сайта вправе отклонить источники трафика без объяснения причин.<br><br>

        К участию в Партнерской сети не принимаются:
        <li>потенциально либо объективно опасные продукты и товары</li>
        <li>товары порнографического характера</li>
        <li>содержащие наркотические и/или запрещенные препараты</li>
        <li>продукция, нарушающая права интеллектуальной собственности любых третьих лиц</li>
        <li>товары и продукты, распространение которых запрещено законодательством.</li>

        <br><br><b><center>4. ГАРАНТИИ И ЗАВЕРЕНИЯ</center></b><br>
        Пользователи гарантируют, что размещаемые офферы и иной Контент не нарушают прав третьих лиц, в том числе, прав на результаты интеллектуальной деятельности и средства индивидуализации.
        Рекламодатель гарантирует, что информация, сообщаемая офферами подтверждается сертификатами, лицензиями и прочими разрешениями, если их наличие требуется в соответствии с законодательством РФ.
        Рекламодатель гарантирует, что товары с товарными знаками и другими средствами индивидуализации, информация о которых размещается Рекламодателем в оффере, введены в гражданский оборот на территории Российской Федерации в соответствии с действующим законодательством. 
        В случае если размещаемые офферы и иной Контент нарушают права третьих лиц на результаты интеллектуальной деятельности и средства индивидуализации, Администрация Сайта вправе потребовать с Пользователя-нарушителя полного возмещения причиненных ей убытков.
        Рекламодатель обязан незамедлительно уведомлять Администрацию Сайта о возникновении у третьих лиц претензий относительно информации, размещаемой в оффере или в качестве иного Контента.
        В случае удовлетворения судом на основании предъявленного третьим лицом искового требования к Администрации Сайта в связи с размещением в Партнерской сети офферов или иного Контента в связи с действиями Рекламодателя и/или Веб-мастеров, распространивших информацию, содержащуюся в офферах (в частности, при нарушении прав такого третьего лица на результаты интеллектуальной деятельности и средства индивидуализации), Рекламодатель и/или Веб-мастер обязаны возместить Администрации Сайта присужденную судебным решением сумму взыскания, в том числе судебные расходы, в полном объеме.
        Возмещение суммы взыскания не освобождают Пользователя от возмещения Администрации Сайта убытков в части, не покрытой неустойкой.

        <br><br><b><center>5. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ.</center></b><br>
        Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации.
        Администрация Сайта не несет ответственности за:
        <li>действия Рекламодателей и/или Веб-мастеров, которые повлекли нарушение прав третьих лиц</li>
        <li>содержание информации, размещенной Рекламодателями и/или Веб-мастерами</li>
        <li>регистрационные данные, указанные Рекламодателем и/или Веб-мастером при регистрации аккаунта и в личном кабинете</li>
        <li>за сайты и онлайн-сервисы, ссылки на которые оставлены Рекламодателями в офферах и лендингах. Рекомендуется переходить по ссылкам на сторонние сайты и онлайн-сервисы с осторожностью, а также ознакомиться с их условиями использования и политикой конфиденциальности.</li>
        Администрация Сайта не является выгодоприобретателем в сделках между Рекламодателями и Веб-мастерами, не несет ответственности и не обязана содействовать Веб-мастерам в организации процессов разбирательств.
        Если иное не указано в настоящем Пользовательском соглашении и не требуется по закону, Администрация Сайта не дает никаких гарантий, заверений и обещаний в отношении Сервиса: Контента, конкретных функций и свойств Сервиса, а также его точности, надежности, доступности и соответствия индивидуальным потребностям Пользователя.
        Пользователь согласен с тем, что Администрация Сайта не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на Сайте или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.
        Пользователь согласен с тем, что Администрация Сайта не несет какой-либо ответственности и не имеет каких-либо обязательств в связи с рекламой.

        <br><br><b><center>6. ПОРЯДОК УРЕГУЛИРОВАНИЯ СПОРОВ.</center></b><br>
        Все возможные споры, вытекающие из настоящего Пользовательского соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации в Арбитражном суде г. Москвы или Таганском районном суде г. Москвы.
        Признание судом какого-либо положения Пользовательского соглашения недействительным или не подлежащим применению не влечет недействительности иных положений Пользовательского соглашения.
        В случае выявления на Сайте незаконного размещения информации, содержащей в себе результаты интеллектуальной собственности, принадлежащие третьим лицам, правообладатель должен:
        <li>составить претензию с указанием фактических и нормативных оснований, которые дают возможность Администрации Сайта изъять информацию из публичного доступа</li>
        <li>прикрепить к претензии доказательства оригинальности результата интеллектуальной собственности (оригинальный экземпляр, другие документы, подтверждающие правообладание на объект авторского и/или смежного с ними права).</li>

        <br><br><b><center>7. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ.</center></b><br>
        Пользователь гарантирует, что он является добросовестным участником гражданского оборота и в полном объеме выполняет все возложенные на него в соответствии с действующим налоговым и иным законодательством РФ обязанности, включая своевременную уплату налогов и сборов, сдачу налоговых деклараций и иной отчетности. Пользователь гарантирует использование всех сервисов в рамках настоящего Пользовательского соглашения в соответствии с законными целями.
        Стороны по настоящему Пользовательскому соглашению осознают весь объем прав и обязанностей, возникающих при заключении Пользовательского соглашения и в полной мере отдают отчет своим действиям, понимая юридическую значимость последствий таких действий.
        <?php if (isset($_SESSION['id']) && $user['agreement'] == '0') { ?>
        <script>
            alert('Для продолжения необходимо ознакомится и подтвердить согласие с пользовательским соглашением');
        </script>
        <form action="" method="post">
            <br><br>
            <center>
                <input type="hidden" name="src" value="<?= $_SERVER['HTTP_REFERER']; ?>">
                <input type="submit" name="btn_accepted" value="Согласен">
            </center>
        </form>
        <?php } ?>
    </div>
</body>
</html>