    <div class="container">

            <?php include './templates/'.$template.'/blocks/menu-top-home.php'; ?>

            <div class="row  page-home mt-30 mb-30 rules">                
                <div class="col-12">
                    <h2 class="">ПРАВИЛА РАБОТЫ C ПАРТНЕРСКОЙ СЕТЬЮ </h2>
                    
                    <p class="mt-25 title-rules">I. ОБЩИЕ ПОЛОЖЕНИЯ</p>
                    <p class="mt-10">
                        1. Партнёрская программа BlackDollar предоставляет возможность вебмастерам работать с предложениями (офферами) своих рекламодателей с оплатой за достижение привлекаемыми пользователями целей на ресурсах рекламодателей.
                        <br>
                        2. BlackDollar осуществляет свою деятельность с использованием собственного программного обеспечения, размещённого на домене avaleads.pro и его поддоменах.
                        <br>
                        3. Для участия в программе как вебмастер необходимо пройти регистрацию.
                        <br>
                        4. Администрация оставляет за собой право отказать вебмастеру от участия в партнерской программе без объяснения причин отказа.
                    </p>
                    
                    <p class="mt-25 title-rules">II. ТРЕБОВАНИЯ К ИСТОЧНИКАМ</p>
                    <p class="mt-10">
                        5. Для начала работы по привлечению посетителей на офферы необходимо зарегистрировать в программе один или несколько источников.
                        <br>
                        6. Источниками могут являться:
                        <br>
                        6.1. Собственные сайты вебмастеров.
<br>
                        6.2. Контекстные, баннерные и тизерные рекламные сети.
<br>
                        6.3. Социальные сети.
<br>
                        6.4. Дорвеи, созданные для привлечения трафика по низкочастотным запросам с поисковых систем.
<br>
                        6.5. Системы арбитража (покупки-продажи) трафика.
<br>
                        6.6. Другие источники после предварительного согласования с Администрацией.
<br>
                        7. Требования к собственным сайтам вебмастеров:
<br>
                        7.1. Суточная посещаемость должна быть не менее 2000 уникальных посетителей в сутки в течение последнего месяца. (За исключением сайтов, созданных для коммерческих целей – агрегаторов промокодов, банковской тематики, игровой и т.п.).
<br>
                        7.2. Сайт не должен нарушать законодательство РФ.
<br>
                        7.3. Сайт должен размещаться на платном хостинге (исключение может быть сделано для страниц-прокладок и отдельных лендингов).
<br>
                        7.4. Не менее 50% трафика на сайте должно быть с поисковых систем.
<br>
                        7.5. Не допускаются к работе в системе сайты с накрученными посещениями.
<br>
                        8. Требования к источникам трафика из социальных сетей.
<br>
                        8.1. Если источник – группа, то ее суточная посещаемость должна превышать 2000 уникальных посетителей в сутки на протяжении последнего месяца.
<br>
                        8.2. Запрещается использовать в качестве источников свои личные страницы.
<br>
                        9. Источник не должен содержать материалы «для взрослых» (adult), в том числе изображения, тексты, ссылки на ресурсы «взрослой» тематики.
<br>
                        10. Каждый источник перед началом использования в программе проверяется Администрацией. Проверка осуществляется в срок до 72 часов.
<br>
                        11. Администрация BlackDollar оставляет за собой право отклонить от участия в программе любой источник без объяснения причин.
                    </p>
                    
                    <p class="mt-25 title-rules">III. ОГРАНИЧЕНИЯ</p>
                    <p class="mt-10">
                        12. Вебмастеру запрещается:
                        <br>
                        12.1. Использовать неодобренные и запрещённые источники.
                        <br>
                        12.2. Использовать источники, нарушающие законодательство РФ, в том числе законодательство об интеллектуальной собственности.
                        <br>
                        12.3. Накручивать систему любым способом, в том числе:
                        <br>
                        12.3.1. Выполнять достижение целей самостоятельно.
                        <br>
                        12.3.2. Выполнять достижение целей другими пользователями в результате просьбы, вознаграждения, обмана или ввода в заблуждение.
                        <br>
                        12.3.3. Скрывать или изменять referer.
                        <br>
                        12.3.4. Изменять IP-адрес в пределах одной подсети или используя прокси-сервера и анонимайзеры.
                        <br>
                        12.3.5. Использовать недопустимые оффером и указанные в его описании источники.
                        <br>
                        12.3.6. Использовать нежелательную рассылку (spam) для привлечения пользователей или других вебмастеров.
                        <br>
                        12.3.7. Использовать для привлечения трафика графические и иные рекламные материалы не относящиеся к целевому офферу, в том числе материалы, принадлежащие другому продукту или бренду.
                        <br>
                        12.3.8. Использовать для привлечения трафика заведомо ложных фактов об оффере.
                        <br>
                        12.3.9. Инициировать автоматические действия посетителей при помощи скриптов, ботов и любых других средств.
                        <br>
                        12.4. Использовать любой трафик с систем активной рекламы (seosprint, wmmail и пр.)
                        <br>
                        12.5. Игнорировать запросы Администрации на предоставление данных об источниках трафика или любой другой информации, касающейся деятельности вебмастера в партнёрской программе BlackDollar.
                        <br>
                        12.6. Вводить Администрацию в заблуждение любыми способами.
                    </p>
                    
                    <p class="mt-25 title-rules">III. ОГРАНИЧЕНИЯ</p>
                    <p class="mt-10">
                        12. Вебмастеру запрещается:
                        <br>
                        12.1. Использовать неодобренные и запрещённые источники.
                        <br>
                        12.2. Использовать источники, нарушающие законодательство РФ, в том числе законодательство об интеллектуальной собственности.
                        <br>
                        12.3. Накручивать систему любым способом, в том числе:
                        <br>
                        12.3.1. Выполнять достижение целей самостоятельно.
                        <br>
                        12.3.2. Выполнять достижение целей другими пользователями в результате просьбы, вознаграждения, обмана или ввода в заблуждение.
                        <br>
                        12.3.3. Скрывать или изменять referer.
                        <br>
                        12.3.4. Изменять IP-адрес в пределах одной подсети или используя прокси-сервера и анонимайзеры.
                        <br>
                        12.3.5. Использовать недопустимые оффером и указанные в его описании источники.
                        <br>
                        12.3.6. Использовать нежелательную рассылку (spam) для привлечения пользователей или других вебмастеров.
                        <br>
                        12.3.7. Использовать для привлечения трафика графические и иные рекламные материалы не относящиеся к целевому офферу, в том числе материалы, принадлежащие другому продукту или бренду.
                        <br>
                        12.3.8. Использовать для привлечения трафика заведомо ложных фактов об оффере.
                        <br>
                        12.3.9. Инициировать автоматические действия посетителей при помощи скриптов, ботов и любых других средств.
                        <br>
                        12.4. Использовать любой трафик с систем активной рекламы (seosprint, wmmail и пр.)
                        <br>
                        12.5. Игнорировать запросы Администрации на предоставление данных об источниках трафика или любой другой информации, касающейся деятельности вебмастера в партнёрской программе BlackDollar.
                        <br>
                        12.6. Вводить Администрацию в заблуждение любыми способами.
                    </p>
                    
                </div>    
            </div>

    </div>


        
    <!-- BEGIN FOOTER -->
        <?php include './templates/'.$template.'/blocks/footer.php'; ?>
    <!-- END FOOTER -->
    
        




    