<?
if( isset($s[1]) && $s[1] == '13/sunduk_dozor' ) {
	/*
		Сундук: Дозорного
3084 - Можно найти Поломанный Меч
3085 - Таящий могущество боевой молот
3086- Старый посох
3087 - Таящий могущество кинжал
3088 - Таящий могущество тяжелый щит
3089 - Обдолбанный старостью шлем
3090 - Стоптанные сапоги
3091 - Вросшие в мусор перчатки
3092 - Прогнившие насквозь браслеты
3093 - Обглоданный червями пояс
3094 - Ошметки от древней кольчуги
3095 - Дремучая заржавевшая броня
3096 - Тронутая разложением рубаха
3097 - Безнадежно выгнутое кольцо
3098 - Сгнившие полностью серьги
3099 - Рваные грязные брюки
3100 - Раздробленный амулет
7655 - Золотой Прун
	*/
	//Все переменные сохранять в массиве $vad !
	$vad = array(
		'go' => true
	);
	
	$vad['test1'] = mysql_fetch_array(mysql_query('SELECT COUNT(*) FROM `dungeon_actions` WHERE `vars` = "obj_act'.$obj['id'].'" AND `dn` = "'.$u->info['dnow'].'" LIMIT 1'));
	$vad['test2'] = mysql_fetch_array(mysql_query('SELECT COUNT(*) FROM `dungeon_actions` WHERE `vars` = "obj_act'.$obj['id'].'" AND `dn` = "'.$u->info['dnow'].'" AND `uid` = "'.$u->info['id'].'" LIMIT 1'));
	if( $vad['test2'][0] > 0 ) {
		$r = 'Вы уже обыскали &quot;'.$obj['name'].'&quot;...';
		$vad['go'] = false;
	}elseif( $vad['test1'][0] > 1 ) {
		$r = 'Кто-то обыскал &quot;'.$obj['name'].'&quot; раньше вас...';
		$vad['go'] = false;
	}
	
	if( $vad['go'] == true ) {
		//Выпадает лут
		$vad['items'] = array(
		7655,7655,7655,7655,7655,7655,7655,7655,7655,7655,7655,7655,7655,7655,
		3084,3084,3084,3084,3084,3084,3084,3084,
		3085,3085,3085,3085,3085,3085,3085,3085,
		3086,3086,3086,3086,3086,3086,3086,3086,
		3087,3087,3087,3087,3087,3087,3087,3087,
		3088,3088,3088,3088,3088,3088,3088,3088,
		3089,3089,3089,3089,3089,3089,3089,3089,
		3090,3090,3090,3090,3090,3090,3090,3090,
		3091,3091,3091,3091,3091,3091,3091,3091,
		3092,3092,3092,3092,3092,3092,3092,3092,
		3093,3093,3093,3093,3093,3093,3093,3093,
		3094,3094,3094,3094,3094,3094,3094,3094,
		3095,3095,3095,3095,3095,3095,3095,3095,
		3096,3096,3096,3096,3096,3096,3096,3096,
		3097,3097,3097,3097,3097,3097,3097,3097,
		3098,3098,3098,3098,3098,3098,3098,3098,
		3099,3099,3099,3099,3099,3099,3099,3099,
		3100,3100,3100,3100,3100,3100,3100,3100
		);
		
		$vad['items'] = $vad['items'][rand(0,count($vad['items'])-1)];
		if( $vad['items'] != 7655 && rand(0,100) < 31 ) {
			$vad['items'] = 7655;	
		}
		if( $vad['items'] != 0 ) {
			//Выбрасываем предмет
			mysql_query('INSERT INTO `dungeon_actions` (`dn`,`time`,`x`,`y`,`uid`,`vars`,`vals`) VALUES (
				"'.$u->info['dnow'].'","'.time().'","'.$obj['x'].'","'.$obj['y'].'","'.$u->info['id'].'","obj_act'.$obj['id'].'",""
			)');
			if( !isset($vad['dn_delete'][$vad['items']]) ) {
				$vad['dn_delete'][$vad['items']] = false;
			}
			if( $this->pickitem($obj,$vad['items'],$u->info['id'],'') ) {
				$r = 'Вы обнаружили предметы...';
			}else{
				$r = 'Что-то пошло не так, предметы растворились...';
			}
		}else{
			$r = 'Вы не нашли ничего полезного...';
		}
	}
	
	unset($vad);
}
?>