<?php
// Heading
$_['heading_title']   = 'Подписка оформлена!';

// Text
$_['text_title']   = 'Подпишитесь на нашу рассылку и получайте скидки!';
$_['text_email'] = 'Введите свой email';
$_['text_name'] = 'Введите свое имя';
$_['text_success'] = 'Спасибо что подписались на нашу рассылку!';
$_['text_empty'] = 'Укажите email и повторите попытку';
$_['text_wrong'] = 'Укажите правильный email и повторите попытку';

// Button
$_['button_action'] = 'Отправить';

// Error
$_['error_exist'] = 'Внимание! Подписка не оформлена';