<?
/*
Template name: История
*/
get_header();
?>
<main class="site-main">
  <div class="rte bagel">
    <div class="html craftcms">
      <div class="body" id="topofpage">
        <main class="site-content" role="main">
          <div class="content ">
            <div class="content__container"></div>
            <section class="block bgcolor--white color--grey--dark noPadding">
              <div class="content__container content__container--full" style="min-height: 100vh;">
                <video class="slideshow-video" preload="auto" playsinline muted="muted" autoplay="" loop="loop" onended="var v=this;setTimeout(function(){v.play()},300)">
                  <source data-src="/wp-content/themes/ball/assets/video.mp4" type="video/mp4" src="/wp-content/themes/ball/assets/video.mp4" codecs="H.264/MPEG-4">
                  <source data-src="" type="video/webm" src="">
                </video>
              </div>
            </section>
            <section class="block  bgcolor--cream color--grey--dark balancedColumns normalPadding">
              <div class="block--has-bkg-2 block--bkg-block"></div>
              <div class="content__container ">
                <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7860">История</h2>
                <div class="col-wrapper row ">
                  <div class="col col--left small-order-2 col--vatop">
                    <p>Для большинства Ball Watch — это мощные, надежные часы с тритием, которые носят ныряльщики, спецназовцы, охотники за торнадо и прочие крутые парни. Но существует и немалое сообщество коллекционеров, знающее Ball как сверхточные винтажные престижные хронометры. И между этими мирами не такая уж большая пропасть. Об этом 125-летняя история швейцарского часового бренда, основанного на легендарном стандарте ORRS Уэбстера Клея Болла.</p>
                  </div>
                  <div class="col col--right small-order-2 col--vatop">
                    <figure>
                      <img src="/wp-content/uploads/2019/08/MW_06_2016_76-81-3.jpg" alt="signatures" data-image="9qfb4lpxpkpt">
                    </figure>
                    <p>Уэбстер Клей Болл (1847-1922)<br></p>
                  </div>
                </div>
              </div>
            </section>
            <section class="block  bgcolor--white color--grey--dark largeLeftColumn normalPadding">
              <div class="block--has-bkg-3 block--bkg-block"></div>
              <div class="content__container ">
                <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7861">Четыре минуты </h2>
                <div class="col-wrapper row ">
                  <div class="col col--left small-order-2 col--vatop">
                    <p>18 апреля 1891 года в городе Киптон, штат Огайо, произошло столкновение экспресса и почтового поезда, в котором погибли восемь человек: шесть почтовых работников и два машиниста. В то время катастрофы на американских железных дорогах не были редкостью. Хотя точную статистику начали вести лишь в начале ХХ века, известно, что только в 1891 году на северо-западных дорогах (Озерный край и Мичиган) в результате столкновений поездов погибли 18 человек и около 200 получили ранения.</p>
                    <p>В основном катастрофы случались из-за ненадежности путей, поскольку шпалы были сделаны из дерева и не выдерживали столкновения мощных стальных локомотивов. Что касается трагедии в Киптоне, то было точно установлено, что причиной столкновения оказались часы одного из машинистов — они отставали от часов другого на четыре минуты.</p>
                    <p>Эта проблема была обычной для того времени. Начать с того, что качество самих железнодорожных хронометров оставляло желать лучшего. Также машинисты и другие работники дороги постоянно имели дело с жаром, влажностью и грязью, которые влияли на точность работы баланса. Наконец, никто особенно и не следил, чтобы машинисты синхронизировали свои часы.</p>
                    <p>Собственно, катастрофа в Киптоне стала основной причиной создания специальной комиссии Конгресса по улучшению безопасности на железных дорогах. И одним из приоритетных направлений работы комиссии было обеспечение синхронизации времени.</p>
                  </div>
                  <div class="col col--right small-order-1 col--vatop">
                    <figure class="image" role="img">
                      <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-81-8.jpg">
                      <figcaption><p>Собственное здание Ball Watch Co. в Кливленде на Эвклид-авеню, 1114 открылось в 1911 году</p></figcaption>
                    </figure>
                  </div>
                </div>
              </div> 
            </section>
            <section class="block bgcolor--white color--grey--dark normalPadding">
              <div class="content__container content__container--full">
                <div>
                  <figure class="image image--fullwidth" role="img">
                    <img class="" style="" width="" height="" src="https://content.bremont.com/images/imager/images/29585/Mikel-Carlsson_guetzli_f236884b7518950919b9efde4423d461.jpg">
                  </figure>
                </div>
              </div>
            </section>
            <section class="block  bgcolor--white color--grey--dark  noPadding">
              <div class="block--has-bkg-5 block--bkg-block"></div>
              <div class="content__container ">
                <div class="col--hundredPercent ">
                  <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7863">В правильном месте </h2>
                  <p>Как утверждал сам Уэбстер Клей Болл в интервью, данном им в 1910 году, двадцать лет назад он просто «оказался в нужном месте в нужное время», причем понимать это надо буквально. Та самая комиссия конгресса прогуливалась по деловому центру Кливленда, пока вдруг случайно не наткнулась на витрину маленького ювелирного магазинчика. А прямо в центре витрины красовался швейцарский хронометр. И он показывал абсолютно точное время.</p>
                  <p>На конгрессменов это произвело такое впечатление, что они решили немедленно зайти в магазин и познакомиться с хозяином, которым и оказался Уэбстер Болл.</p>
                  <p>А, узнав, что точное время на часах — не случайность, что хозяин-аккуратист каждую неделю сверяет все часы в магазине по сигналу морской обсерватории, члены комиссии, недолго думая, поздра вили друг друга с успехом — в Кливленде появился новый чиновник. Уэбстер Болл был назначен Главным инспектором времени на железной дороге LakeshoreMichigan.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-81-2.jpg">
                    <figcaption><p>Ball & Co. No. 307412, серия VIll, около 1893 г. и Ball & Co. No. B269465, официальная маркировка ORRS, калибр хронометра 999, около 1922 г.</p></figcaption>
                  </figure>
                  <p>Почему Кливленд? Потому что в то время это был крупнейший индустриальный узел Среднего Запада. Там была сталелитейная промышленность, была нефть. Город рос с огромной скоростью, ведущие компании во главе с самим Рокфеллером строили свои представительства и небоскребы. И, естественно, через город пролегали множество железнодорожных путей, связывающих разные концы огромной страны, от Мексики до Канады, от западного до восточного побережья.</p>
                  <p>Став главным хронометристом железных дорог, Болл показал себя ответственным организатором. Уже в 1893 году он ввел стандарт точности: не более 30 секунд в неделю и не более 3 секунд в сутки при шести позициях баланса. В каждом железнодорожном депо на подотчетных ему дорогах инспектор распорядился установить стационарный хронометр, по которому должны были ежедневно сверять свои часы все работники. В свою очередь сами хронометры каждые сутки должны были проверять точность по сигналу, передаваемому по телеграфу из обсерватории ВМФ США.</p>
                  <p>В конце концов, Болл получил контроль над временем на всех 200 000 километрах американских железных дорог и трудно даже примерно подсчитать, сколько жизней было спасено благодаря его твердым правилам. А ведь этот человек даже не был часовщиком.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/ball.jpg">
                    <figcaption><p>Trainmaster на основе Ball Official Rail Road Wristwatch со швейцарским механизмом Avia впервые представлены в 1959 году</p></figcaption>
                  </figure>
                  <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7863">Tiffany среднего запада </h2>
                  <p>Уэбстер Клей Болл родился в 1847 году на ферме близ городка Фредериктауна в Огайо. Как и многие молодые люди того времени, он начал жизненный путь коммивояжером. А именно продавал корпуса и детали часов в магазины по всей стране. В итоге он поступил на постоянную службу в ювелирный магазин Whitcomb & Metten Jewelers в Кливленде. Вскоре Меттен вышел на пенсию, и молодой ассистент выкупил его долю. Магазин стал называться Whitcomb & Ball в 1879 году, а в 1881 году Болл стал единоличным владельцем бизнеса.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/ball_hist_0001.jpg">
                    <figcaption><p>Ball & Co. No. 307412, серия VIll, около 1893 г. и Ball & Co. No. B269465, официальная маркировка ORRS, калибр хронометра 999, около 1922 г.</p></figcaption>
                  </figure>
                  <p>В начале ХХ века Ball стал монополистом во всем, что касалось железнодорожных хронометров. Без его официальной сертификации Official Rail Road Standard (ORRS) ни один производитель не мог стать поставщиком главнейших национальных путей сообщения. А часы, уже отданные в эксплуатацию машинистам и кондукторам, в обязательном порядке должны были каждые две недели проходить проверку специалистами Ball. Но если критерии Болла ко всем железнодорожным часам были довольно строгими, то самые жесткие требования он предъявлял к часам, на которых стояло его собственное имя.</p>
                  <p>За весь американский период истории Ball Watch никогда не производил собственных механизмов или корпусов. В разные периоды в часах марки устанавливались калибры Waltham, Elgin, Hamilton, других крупнейших национальных часовых производителей, но при этом они самым тщательным образом тестировались.</p>
                  <p>Готовые часы поступали в лабораторию Ball на Эвклид-авеню, которая занимала целый этаж здания над магазином, там разбирались и тщательно проверялись на точность хода, водонепроницаемость, ударопрочность и даже антимагнитность. Можно сказать, тестирование Ball начала прошлого века напоминало современные стандарты COSC вместе с Chronofiable. Кстати, есть небезосновательная версия, что сами стандарты COSC, принятые в 1973 году, во многом были списаны с нормативов Ball.</p>
                  <figure class="image image--fullwidth" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-81-13.jpg ">
                  </figure>    
                  <p>О въедливости проверяющих компании ходили легенды. Особенно боялись некую Мэри Бэбкок, главную «ревизоршу» Ball, работающую с хозяином еще со времен его первого магазина. Малейшее несоответствие регламенту влекло немедленный возврат хронометра на доработку. Конечно, многие владельцы часовых фабрик не испытывали теплых чувств к Боллу, но возможность ставить его имя на свои изделия стоила неизмеримо выше. К тому же, не стоит забывать и о необыкновенной популярности самого магазина, где продавались все эти часы. В первой половине ХХ века у Ball Jewelry Store в Кливленде была репутация «Tiffany Среднего Запада». Это был самый шикарный и популярный ювелирный и часовой магазин на пути от Чикаго до Нью-Йорка. А к середине 20-х годов Ball открыла еще пять представительств в крупнейших городах США, став одной из самых распространенных розничных часовых сетей в стране. Уэбстер Клей Болл скончался в 1922 году на самом пике расцвета своей железнодорожно-часовой империи.</p>
                  <p>Но затем серьезный удар по корпорации Ball нанесла Вторая мировая война, которая привела к упадку национального железнодорожного сообщения и, соответственно, роли Ball как главного хронометриста и поставщика. В 1962 году наследники приняли решение окончательно выйти из бизнеса, правда, сохранив за собой имя бренда.</p>
                  <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7863">Экспресс на восток</h2>
                  <p>Вначале магазин Болла торговал в основном швейцарскими часами, но уже в 1893 году он представил первые часы с американским калибром E. Howard.</p>
                  <p>С 1895-го главным поставщиком механизмов Ball являлся Hamilton, который в 1904 году изготовил по специальному заказу сверхточный калибр. В классификации Ball он получил маркировку 999 — в честь Гудзонского локомотива № 999, способного развивать скорость до 180 км/час. Однако уже после войны марка вынуждена была перейти на швейцарские калибры 435, 435B и 435C от фабрики Record Watch Co., оснащенные системой Incablok. А в начале 1940-х Ball представила и свои первые наручные часы, которые также работали на швейцарской механике, произведенной на фабрике Avia в Ла-Шо-де-Фоне. Именно с калибром Avia в 1959 году были выпущены часы, которые первыми из наручных получили знак ORRS. А также более емкое коммерческое имя — Trainmaster.</p>
                  <p>Уже в середине 1950-х наследники Болла задумались о том, чтобы перенести выпуск часов в восточное полушарие, в Швейцарию. Некоторые модели уже тогда начали не только оснащаться швейцарскими механизмами, но и собираться в Ла-Шо-де-Фоне, о чем свидетельствует надпись Fabrique en Swiss на наручных циферблатах Ball того времени. К сожалению, планы эти были прерваны банкротством самой компании в Кливленде.</p>
                  <p>Надо отметить, двадцатилетний перерыв в истории Ball в историческом плане пошел Trainmaster на пользу, так как компания естественным образом избежала кварцевого бума и искушения скатиться в массовый сегмент. Зато уже в 1991 году права на марку выкупила группа инвесторов из Флориды, по слухам, связанная с самими наследниками семьи Болл. Они приняли ряд стратегически правильных решений, важнейшим из которых оказался окончательный курс на Швейцарию.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-81-5.jpg">
                    <figcaption><p>Trainmaster Cleveland Express в стальном корпусе 41 мм, 15 микротрубок trigalight, автоматический калибр RR1102-C Хронометр с 8-дневым заводом 1933 года, ставший образцом для Trainmaster Cleveland Express</p></figcaption>
                  </figure>
                  <h2 class="h1 block__title block__title__left animated animation-delay-60" data-action="has-animation" data-animation-type="fadeIn" data-animation-index="title-7863">Возвращение RR</h2>
                  <p>Будучи независимой компанией, Ball двигалась постепенно. Можно сказать, стратегия марки после возрождения сводилась к принципу «лучше что-то не успеть, чем сделать неверный шаг». Ее самой первой обновленной коллекцией стал, естественно, Trainmaster, прибавивший после переезда в Ла-Шо-де-Фон немного традиционного швейцарского шика. Корпус стал круглым и полированным, с узким рантом, внутри заработали классические калибры 2824 и 7750. Но самый почетный знак остался на месте: рядом с именем Ball на циферблате по-прежнему красовалась надпись Official Rail Road Standard. Кроме того, аббревиатура RR отныне неизменно украшала противовес секундной стрелки.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-81-6.jpg">
                    <figcaption><p>Trainmaster 125 Years Anniversary в корпусе 46 мм с калибром RR2101 с ручным заводом, памятная гравировка на задней крышке, циферблат в стиле ORRS, лимит 125 пронумерованных экземпляров</p></figcaption>
                  </figure>
                  <p>Естественно, все часы ORRS должны были соответствовать стандартам хронометра. Но решив посылать новые модели на сертификацию COSC, специалисты Ball оказались едва ли не единственными, кто прочитал все требования лаборатории буквально до последнего пункта, в том числе о том, что касается читаемости циферблата в темноте. Не удовлетворившись эффективностью обычной люминесцентной краски, инженеры нашли неожиданное решение — марка стала первым часовым клиентом фабрики MB Microtec в Берне, которая единственная в мире использует запатентованную и абсолютно безопасную технологию микротрубок подсветки с тритиевым газом.</p>
                  <p>И хотя Trainmaster является самой классической линией марки, в этой коллекции регулярно появляются новые изобретения и технологии от лаборатории Ball: от запатентованного механического термометра до индикатора фазы Луны, целиком выложенного тритиевой подсветкой. А в 2016 году именно в Trainmaster состоялся дебют первого в истории собственного калибра Ball, изготовленного на мануфактуре марки в Ла-Шо-де-Фоне.</p>
                  <figure class="image" role="img">
                    <img class="" style="" width="" height="" src="/wp-content/uploads/2019/08/MW_06_2016_76-8.jpg">
                    <figcaption><p>Trainmaster Manufacture, представленный в 2016 году лимтированной серией 125 экземпляров, оснащен первым мануфактурыным калибром RRM1101, корпус из розового золота 40 мм высотой 10 мм</p></figcaption>
                  </figure>
                  <p>Насколько на самой родине Ball почитают Trainmaster, можно судить по тому, что именно часы этой серии чаще всего появляются в голливудском кино и на телеэкране. Trainmaster Cleveland Express носят герои Уилла Ферелла в фильме «Копы в глубоком запасе» и Дензелла Вашингтона в «Опасных пассажирах поезда 123», а Trainmaster Eternity — любимые часы Ричарда Касла из одноименного сериала.</p>
                  <p>Современная история Ball Watch хорошо известна, причем в основном приверженцам активного образа жизни. Марка сумела найти свою особую нишу и в новом тысячелетии, установив собственные высокие стандарты антимагнитности, противоударности, водозащиты — теперь уже для тех, кто летает в стратосферу, ныряет в океанские глубины и поднимается в горы. При этом старейшей и важнейшей в ее арсенале по-прежнему остается коллекция Trainmaster, напоминающая о том, что локомотивы — это классика, с которой не соскучишься.</p>
                </div>
              </div>
            </section>
          </div>
        </main>
      </div>
    </div>
  </div>
</main>
    
<? get_footer(); ?>